{"id": "confluence_4024041523", "title": "Giving Okta the Finger", "content": "If you have a Macbook with Touch ID functionality, you can bypass the back-and-forth of push notifications and code entry. (Estimated setup time of instructions : < 2 minutes…) [INFO] If you have a PC for work, you can contact to setup Windows Hello such that you, too, can use biometric authentication. Instructions Begin by following these instructions to setup your Macbook TouchID if you have not already done so. Make sure you are on the latest version of OV by clicking the About section. You should be on at least version 9.10 Once confirmed, you can close this window out and go back to your Okta Verify main window, shown below. Click on your account. If not shown and is asking you to setup up. Click New account and set login.simpli.fi as the sign-in URL Following the redirect to your browser. Please ensure you are being redirect to login.simpli.fi NOT simpli.okta.com You will be prompted to authenticate your account in a new window. Click on your account, and enable touchID. If your Okta Verify desktop client has alerts on the Okta will remember the last authentication method you chose when logging you in the next time. But if for any reason it does not, simply select Verify with something else and select the Okta FastPass option. It should remember going forward! Troubleshooting touchID There may be times when your touchID just stops working or needs to be re-synched to your Okta account. This will sometimes happen after an OS update or Okta Verify update. 1. Open the Okta Verify app located in the top task bar of your laptop. Check to make sure your account is listed, click on your account to go to the touchID section. If you do not see your account, then you will need to register your device to your account. If you do not see any error messages here or any notifications. Toggle the touchID button off/on and it should prompt you to Re-Authenticate your account and connect your touchID. *** NOTE *** Make sure you have your phone available in order to MFA with Okta Verify or another MFA source that you have previously set up. There may be some instances where you will need to Re-enroll if your MFA was reset for a device. Click the Re-enroll link and register your machine. [NOTE] If you use a password manager in addition to Okta (like Dashlane), please be aware that Okta puts security keys and biometric authentication in the same bucket, so to speak. So when you have a security key provided by Dashlane, it may not know to default to your Macbook biometric authenticator. Simply click Verify with something else after you first enter your email address. Click the option for Security Key or Biometric Authenticator and select the option that is not the security associated with your password manager.", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4024041523/Giving+Okta+the+Finger", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4024041523", "version": 8, "last_modified": "2024-09-17T17:30:18.413Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3620143105", "title": "Initial Setup", "type": "page"}, {"id": "3620012052", "title": "Authentication Methods", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
