{"id": "confluence_4512579596", "title": "Future DocuSign Functionality", "content": "DocuSign is currently somewhat manual, wherein people upload documents or use document templates to send for signature. The user then can download to their personal or shared Google Driver folders. One exception is for the Software Sales team that utilizes Salesforce CPQ+ . This is a fully integrated solution to initiate document generation, sending, approval, and storage in Salesforce. Beginning September 1, 2024, the Digital Workplace team is partnering with Business Solutions and Sales team stakeholders to explore options for: Automations to store relevant DocuSign files in Salesforce accounts (goal for January 1, 2025) Contract Lifecycle Management with DocuSign<>Salesforce (exploring functionality) CPQ+ for Media Planning team (very long term goal) The goals of these explorations are to: reduce toil for salespersons in crafting Insertion Orders, reduce turnaround time for getting signatures share relevant IOs with anyone working on the account currently or in the future Update! As of November 2024, we have begun the process to streamline the IO creation and sending experience with the DocuSign<>Salesforce integration (to be deployed to all Sales team members in December 2024). We are also kicking off the DocuSign Contract Lifecycle Management (CLM) feature set in November 2024 to further provide visibility and automated organization of all Sales contracts.", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4512579596/Future+DocuSign+Functionality", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4512579596", "version": 5, "last_modified": "2024-10-30T21:11:57.672Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "4513169437", "title": "DocuSign E-Signature", "type": "page"}, {"id": "4512874554", "title": "Transition from Adobe Acrobat Sign", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
