{"id": "confluence_4099899421", "title": "The Okta-phant in the Room", "content": "Sure, there’s no such thing as an Okta-phant. But on the Digital Workplace team, we understand that whenever Okta is mentioned, it garners an exhausted eye-roll from some and trepidatious avoidance from others. We hear you. We get it. We believe it’s our job to listen and make it better for all Simpli.fi users. You’ll never hear us claim that Okta is perfect. But it does have some benefits: Just last quarter Okta prevented and blocked over 200 threat actors. We have saved ~100K since its implementation in license reductions and mistaken assignments. Onboarding efforts reduced significantly (estimated 95% speed-up in application assignments) Even if you do not feel these benefits in your day-to-day, there are a few things we can recommend to make Okta helpful. What follows are some tips for making Okta work for you... Logging into Okta with a Touch You may have seen my reference to in the Digital Workplace channel . It’s true! You can log into Okta without having to check your phone for a code. Simply follow the instructions in the aforementioned article, and you, too, can enter Okta with a quick touch. Please note, the instructions are catered toward Macbook TouchID setup. However, if you would like Windows Hello for the purposes of biometric authentication, you can work with the Digital Workplace Desktop Support Sub-team to obtain that functionality. Auto-launching Applications in Okta Okta works best if you log into it directly from simpli.okta.com at the beginning of your day. So when you’re sipping your first cuppa, log into Okta. We’ve set the session limit for the portal to last beyond your eight hour work day. If you’re logged in there first, you shouldn’t have to log into each of your applications in separate browser tabs. (Some notable exceptions to this are applications, like UKG, that log users out after an hour of activity due to privacy concerns). If you don’t enjoy clicking the Okta tiles, you can auto-launch applications of your choosing each time you log into the Okta portal. That additionally applies for any web apps you store in Okta tile password management, or . (That’s right, ‘there’s a tile for that' if you want it--not just apps that Simpli.fi manages.) Using the Okta Chrome Extension If you want to feel like an Okta power user or hate clicks in general, the Okta Chrome Extension is for you. It has been automatically added to every employee’s Chrome browser. With a simple COMMAND + SHIFT + O , you can begin typing the name of the application you’re wanting to access, hit ENTER and voilà! Improving Employee Experience through Okta Workflows We know employees may not understand the behind-the-scenes work that Okta does in provisioning applications. If we’re doing our jobs, you won’t even think about it. However, as a peek behind the curtain, we can share that: Okta Workflows automate nearly every event-based application update. As one recent example, Kaitlin Purdham used an Okta workflow to provide UKG attributes to the Slack API. Now you can see your colleagues' place in the org chart , their manager, their direct reports (if applicable), their official title, and their start date--all from with an application where you spend most of your time. (Fun fact: thanks to this attribute mapping, your Slack profile now throws you a party on your work anniversary!) We have dozens of Okta workflows to provide the personalized touches that enhance your experience. In short, if there’s an Okta-oddity thwarting your optimal workflow, don’t suffer in silence. If there’s an idea you have to improve operational efficiencies, let us know. Chances are, there’s something further we could do (with Okta) to improve your digital workplace.", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4099899421/The+Okta-phant+in+the+Room", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4099899421", "version": 12, "last_modified": "2024-02-23T17:37:39.253Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
