{"id": "confluence_3940188191", "title": "Duplicate Tiles in Okta Dashboard", "content": "Summary Your Okta dashboard has tiles for: Applications that the Digital Workplace Solutions team put behind Okta administration. Applications that are not currently behind Okta, but that the Digital Workplace Solutions team added to all users for purposes of easily maintaining credentials (such as our Simpli.fi UI, which does not yet have SSO capabilities). Applications that you as a user added by allowing Okta to save your password for sites you visit. In the case of the latter, keep in mind that the Digital Workplace Solutions team does not manage those tiles. You have the ability to edit their contents (tile display name, the redirect URL, user name, password, auto-launch capabilities) and even remove the tile. Sometimes, when you allow Okta to save a password for you, it might save multiple tiles (say, in cases where you entered new credentials), just like Google Chrome Password Manager might save multiple sets of credentials. If you have duplicate tiles, you are able to remove an outdated one by: Hovering over the duplicate tile. Clicking the tile. In the side panel that opens on the left, clicking “Remove.” Video Tutorial [Image]", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3940188191/Duplicate+Tiles+in+Okta+Dashboard", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3940188191", "version": 1, "last_modified": "2023-10-31T14:38:46.313Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3627122699", "title": "Okta Troubleshooting Guides", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
