{"id": "confluence_4512809054", "title": "FAQ's: The Move to DocuSign", "content": "[TOC] 1 6 false none list true What does this mean for me as an Acrobat Sign user? If you need to be able to edit PDFs frequently, you can utilize Acrobat Business Standard. We will keep this functionality available and have licenses already assigned to those who have needed it historically. If you currently use Adobe Acrobat Sign for documents sent for electronic signatures, you will receive a direct Slack message notifying you of this change and confirming that you have been assigned a DocuSign account ( ). Does this impact other Adobe products? No. Anyone who needs access to Creative Cloud products (e.g., Illustrator, PhotoShop, Acrobat Pro) will still keep these licenses. When will this change take place? We have access to DocuSign currently and will be adding all Adobe Users into DocuSign Okta groups starting August 19th. When should I stop using AdobeSign? Please stop using AdobeSign as soon as you see the DocuSign tile in your Okta dashboard (by end of day August 19th). We will hide the AdobeSign Okta tile on August 20th so as to prevent confusion; but please also stop sending files for signature through it. What will happen to all of my files? You can download your Acrobat Sign files to your team’s shared Google Drive (preferable). If your team does not have a shared Google Drive, consider creating one 😅 … or save to your personal Google Drive folder. We will additionally perform a bulk export of all files currently in Acrobat Sign from August 29th - 31st. What about the templates I created in Adobe Acrobat Sign? While we have the ability to export documents in bulk, and you can download your documents, Adobe does not allow people to download templates. We can help you recreate your templates as needed. Please contact the Digital Workplace team via digitalworkplace@simpli.fi or #digital-workplace Slack channel for assistance. (You have the ability to create these templates yourselves, and to even use someone else’s template once they create it--whether via sharing the template with a group or by uploading them in bulk into DocuSign to your account). I did not cancel my in-progress (“Out for Signature”) documents in Adobe Acrobat Sign before the transition. What can I do now? Contact the digitalworkplace@simpli.fi or #digital-workplace Slack channel to be temporarily re-added to the Adobe SSO group in Okta. This will give you access to view your in-progress documents in Adobe Acrobat Sign. You can then follow these steps to cancel each item that was sent for signature. Please notify the digital workplace team when you have finished your work in cancelling. You can then be removed from Adobe SSO access. I used DocuSign before it became the company-wide default. How does the additional user base impact me and what can be seen? By default, no one can see document envelopes unless they are the signer or sender. However, you have a couple options now to share templates with your departmental group, or share documents with users whom you approve. Please see this brief video for more information… [Image]", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4512809054/FAQ+s+The+Move+to+DocuSign", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4512809054", "version": 6, "last_modified": "2024-09-18T17:48:17.278Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "4513169437", "title": "DocuSign E-Signature", "type": "page"}, {"id": "4512874554", "title": "Transition from Adobe Acrobat Sign", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
