{"id": "confluence_4220125185", "title": "Adobe Dashboard Guide: Logging into Adobe Dashboard/Local Apps with Okta SSO", "content": "This guide covers the generic Adobe sign-in page which provides access to all your assigned Adobe applications. However, for a more streamlined experience, logging in directly to the specific Adobe app is often recommended, especially if you primarily use only one. Most Adobe applications can be accessed directly via their dedicated Adobe domain http://acrobat.adobe.com 🔐 Secure Authentication with Okta SSO At Simplifi, we prioritize security. We require signing in with Okta SSO (Single Sign-On). This method provides significantly enhanced platform security compared to the less secure AdobeID which relies on traditional username/password authentication. While Adobe supports Okta authentication, the login process itself is initiated on the Adobe side. For your convenience, an Adobe application tile is available on your Okta dashboard to facilitate easy access. :steps: Steps to log into Adobe Dashboard and Apps: ⛵ Navigate to Adobe.com : This will take you to the Adobe home page. 👀 Click Sign In : Locate and click the \"Sign In\" button in the top right corner of the Adobe home page. [Image] :email: Enter Simplifi Email: On the Adobe sign-in page, type in your Simplifi email address. Then, click \"Continue.\" [Image] 🏢 Select \"Company or School Account\": This action will lead you to a new page. You might see a similar view or only the \"Company or School Account\" option. Select \"Company or School Account\" to proceed with Okta authentication. Upon completing these steps, you should be signed into your Enterprise Adobe dashboard. [Image] :troubleshooting: Authentication & Troubleshooting Okta Prompt: If you are not already signed into Okta when you access the Adobe sign-in page directly, you will be prompted for your Okta credentials. MFA Prompts: There may be instances where you are prompted for MFA (Multi-Factor Authentication) even if you are already signed into Okta. This is a normal behavior of Adobe's session cookie processing and helps maintain secure access. [Image] Did you know there is an Okta icon in your Chrome toolbar that provides quick and easy access to all your apps? If you don't see it, simply click the puzzle piece icon and then select the pin next to the Okta Browser plugin. This will allow you to log in to your account swiftly and access all your apps with ease!   [Image] [Image]       [Image]\n\nPage Labels: dws-user, adobe, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4220125185/Adobe+Dashboard+Guide+Logging+into+Adobe+Dashboard+Local+Apps+with+Okta+SSO", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4220125185", "version": 14, "last_modified": "2025-06-13T20:39:09.058Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "4203053083", "title": "Adobe Enterprise Products: Guides for logging into Adobe applications", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
