{"id": "confluence_3844472833", "title": "Miro Board Role Groups - What are they and why do they matter?", "content": "[MIRO-MACRO-RESIZING] https://miro.com/app/live-embed/uXjVPRh2WCI=/?boardAccessToken=tVBbannaLXCVcochw8KK8xBC0jzyjOob&autoplay=true&embedMode=view_only_without_ui This board provides a visual representation of the functional roles throughout our organization. A role refers to a position, job title, or set of tasks assigned to an individual. It helps us understand the organizational structure and responsibilities within our company. By visualizing the hierarchy and relationships between roles, we aim to foster a more efficient and effective work environment. Purpose and Significance The primary purpose of this Miro board is to provide a clear overview of our company's functional roles, enabling better collaboration and understanding across different teams and departments. Our company's functional roles are organized using a bottom-up approach, where the lowest point in the hierarchy comes first. The hierarchy is structured as follows: Roles: a position, job title, or set of tasks assigned to an individual Teams : Cross-functional teams, or sub-teams operating within the departments. Value Streams: Sub departments within Engineering. Departments : Situated under each division, representing specific functional areas within the divisions. Divisions : The highest level of the hierarchy, representing the five main divisions in our company: Administration Marketing Client Services Engineering Sales Roles: a position, job title, or set of tasks assigned to an individual Sub Teams : Org Level 4 Teams/Value Streams: Org Level 3 Sub Departments : Org Level 2 Departments : Org Level 1 - The highest level of the hierarchy, representing the five main departments in our company: Administration Marketing Client Services Engineering Sales Naming Scheme Explanation We use a consistent naming scheme for each group to make identification and understanding easier. The naming scheme follows this format: Role : <role-name>_<team-name>_role Sub Team: <sub-team-name>_<team-name>_subteam Team : <team-name>_<sub-department-name>_team (or <team-name>_<vs-name>_team for value streams) Value Stream : <vs-name>_<sub-department-name>_vs Sub Department : <sub-department-name>_<department-name>_subdept Division : <department-name>_dept Why Use This Group Structure? Rather than assigning individual permissions to each user (which is considered bad practice), we can assign permissions based on the person's 'role'. These roles allow us to easily manage permissions for individuals by assigning a few groups, rather than configuring permissions across hundreds of applications. This streamlined approach enhances security, simplifies access management, and reduces the risk of errors. Moreover, with this group structure, any new hire coming into their position already has all the permissions they will need on day one. This eliminates delays in granting access and ensures employees can start being productive right away. This method also ensures that when an employee leaves the company, their access is removed immediately when the groups are unassigned from their profile. Example Scenario Let's illustrate the naming scheme with a few examples: Sales Director on the Northeast Sales Team Role: salesdirector_sales-northeast_role Team: northeast_sales-direct_team Sub Department: directagency_sales_subdept Department: sales_dept Database Engineer on the Ocelots Infrastructure Team Role: dba_infra-ocelots_role Sub Team: ocelots_infrastructure_subteam Team/Value Stream: infrastructure_development_vs Sub Department: development_engineering_subdept Departmetn: engineering_dept\n\nPage Labels: virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3844472833/Miro+Board+Role+Groups+-+What+are+they+and+why+do+they+matter", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3844472833", "version": 5, "last_modified": "2023-12-29T19:05:14.601Z", "author": "Kaitlin Purdham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3628924947", "title": "Miro", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
