{"id": "confluence_4162125828", "title": "Adobe Acrobat Guide: Logging into Adobe Acrobat Enterprise/Pro (PDF Maker) with Okta SSO", "content": "This is a step-by-step guide for logging into Adobe Acrobat Pro (also known as PDF Maker) using Okta and Single Sign-On (SSO). 🔐 Enhanced Security with Okta SSO At Simplifi, we leverage Okta SSO to provide significantly enhanced security for accessing our platforms, including Adobe Acrobat Enterprise. This method is far more secure than the traditional AdobeID which relies on less secure username/password authentication. While Adobe fully supports Okta authentication, the actual login process begins on the Adobe side. For your convenience, you'll find an Adobe application tile directly on your Okta dashboard, designed to take you straight to the login page. :steps: Steps to Log In to Adobe Acrobat Enterprise. Access Okta Dashboard : First, log into your Okta dashboard by navigating to login.simpli.fi . Use Adobe Bookmark Tile : On your Okta dashboard, locate and click the bookmark icon tile for Adobe. This tile is designed to take you directly to the Adobe Acrobat Pro login page. [Image] 👀 Initiate Sign-In : This will direct you to the Adobe Acrobat Enterprise/Pro home page .(Depending on your license) In the top right corner, click \"Sign In.\" [Image] :email: Enter Simplifi Email : On the subsequent sign-in page, type your Simplifi email address into the designated field. Then, click \"Continue.\" [Image] 🏢 Select Company or School Account: A new page will appear. You might see a similar view or only the \"Company or School Account\" option. Select \"Company or School Account\" to proceed with the Okta authentication flow. [Image] After completing these steps, you should be successfully signed in to your Adobe dashboard, granting you access to Adobe Acrobat Enterprise/Pro. :troubleshooting: Authentication & Troubleshooting Okta Prompts: If you are not already signed into Okta when you directly access the Adobe Acrobat Pro login page, you will be prompted for your Okta credentials. MFA Prompts : There may be instances where you are prompted for MFA (Multi-Factor Authentication), even if you are already signed into Okta. This is a normal part of Adobe's session cookie processing and helps maintain a secure connection. [Image] There is an Okta icon in your Chrome toolbar for quick and easy access to ALL your apps? If you don't see it, click the puzzle piece then click the pin next to Okta Browser plugin. From here you can quickly log in to your account and quick access to ALL your apps!   [Image] [Image]       [Image]\n\nPage Labels: dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4162125828/Adobe+Acrobat+Guide+Logging+into+Adobe+Acrobat+Enterprise+Pro+PDF+Maker+with+Okta+SSO", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4162125828", "version": 13, "last_modified": "2025-06-13T20:38:42.682Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "4203053083", "title": "Adobe Enterprise Products: Guides for logging into Adobe applications", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
