{"id": "confluence_4140335115", "title": "Avoiding Re-authentication", "content": "[PANEL] Okta’s expected behavior is to operate like our headquarters' doors--quickly flash your badge and you have access to what you need to do your work. You should not have to use your badge to get into every office room, so to speak, once you’ve already shown your credentials to get in the front door. In February 2024, we noticed that users were being prompted to authenticate in individual applications after already providing their credentials at login. This is not expected behavior. Funnily enough, Okta would also show the user as having logged in 54 years ago ( since the dawn of the Unix Epoch !) before asking them to re-authenticate with each click of an application tile. To avoid this, we recommend taking the following steps… Upgrade to the Optimal Okta Experience Ensure you have the latest Okta Verify desktop client. Many will have received this update already to their workplace computers via an action taken by the Desktop Support team on February 7, 2023. If not, it is included: For more context on the desktop client of Okta Verify (Fast Pass) see the following resource: When prompted, sign into the Okta Verify desktop client by adding a new account (remove your other one if still present). Click New account and set login.simpli.fi as the sign-in URL [Image] Following the redirect to your browser. Please ensure you are being redirect to login.simpli.fi NOT simpli.okta.com Follow the steps to re-enable your Touch ID (see ) If your Okta Verify desktop client has alerts on the 🛡️ icon, please follow its instructions to update your operating system. [Image] If you are in the Chrome browser, reset your Okta Chrome extension: [Image] After ensuring you have the most up to date Okta Verify desktop client and an updated MacOS (as applicable), log into the Okta Portal ( login.simpli.fi ) and try clicking an application tile. You should now be able to click into applications without being prompted to re-authenticate. Give Okta the Finger As a general rule, it’s best to ensure you have everything up to date (your operating system, Okta Verify, etc.) But in addition, we HIGHLY recommend setting up touchID with your Macbook or WindowsHello with your PC where available. Biometric authenticators, such as touchID , allow you to sign into your Macbook and into your Okta dashboard with only your finger. No need for password, typing in a code, OR searching for a password notification. Super fast and Super easy. Follow these steps…\n\nPage Labels: dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4140335115/Avoiding+Re-authentication", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4140335115", "version": 17, "last_modified": "2024-03-19T19:54:45.418Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3627122699", "title": "Okta Troubleshooting Guides", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
