{"id": "confluence_3137962030", "title": "Bitwarden Guide: Access and Logging into with Okta SSO", "content": "This document provides a comprehensive guide to Bitwarden, explaining its purpose and detailing the steps for requesting access, activating your account, accessing the application, and troubleshooting common issues. Note: Screen shots are for representation only and may have been changed on the Bitwarden site. What is Bitwarden Bitwarden is a secure password manager used to securely store shared passwords and keys among teams. It provides a centralized and encrypted vault for managing sensitive credentials, enhancing security and collaboration. I. Requesting Access to Bitwarden The Digital Workplace team has developed an automated self-service request process for quick access to the Bitwarden platform. There are several ways listed below to initiate your Bitwarden access. Slack. (2 Options) Slack Option 1: Request via Slack (Okta App) [Image] Search for the Okta app under \"Apps\" in Slack. If it's not visible, click \"Add apps\" and select the Okta app. Under the \"Home\" tab of the Okta app, click \"Choose a resource.\" Select: \"Bitwarden\" Slack Option 2 : Request via Slack (#digital-workplace channel command) [Image] From within the #digital-workplace Slack channel , type the following command directly into the channel (case sensitive): /access Bitwarden click continue and you will begin the same process. [Image] c. Add a short description why you are requesting access. d. Select Yes/No if your manager is available. - If manager is not available, the approval process goes to the Digital Workplace team. [Image] e. Click Submit. f. A Jira ticket will be generated and assigned the status of Waiting Approval . Once approval is obtained, proceed to Step II below to send the Activation Email and complete the setup of your account. Request from the Okta Access Request Panel a. Navigate to your Okta dashboard and select the tile labeled \"Okta Access Request.\" [Image] b. This will open a separate console for you to request the Bitwarden app (along with many other apps) click the Request access and you will be prompted with same or similar steps and questions as above. [Image] [Image] Request For: Select ‘You’ and fill out questions and click Submit. note: You can submit a request on behalf of another user. Step II. Activation Email After submitting your request, please check your email for the account activation message. [Image] Click Go to vault. Enter in your email if not autofilled. Click Continue. [Image] Click the Log in Option. [Image] Click sign-in with Enterprise single sign-on. [Image] If you are not currently logged into your Okta console, you will be prompted to authenticate using your Okta credentials. After successfully authenticating, the next step is to establish your Master Password. It is crucial to adhere to the complexity guidelines while creating this password. This Master Password works in conjunction with Okta authentication and is integrated directly into the app. [Image] Click submit. You will need to enter in your Master Password to access your vault now after . [Image] Account Confirmation: Once your account is created, the Digital Workplace team will verify it within the Bitwarden administration tenant, adding an extra layer of security. Step III: Accessing Bitwarden the app. You will find a Bitwarden tile on your Okta dashboard, which currently directs you to the Bitwarden login page. Once there, you will need to enter your credentials. [Image] You can also Navigate to https://vault.bitwarden.com/#/login directly. [Image] Enter your email address and continue. You can either click \"Continue\" or utilize \"Single Sign-On.\" Both options will authenticate you through Okta seamlessly in the background. [Image] Once Okta Authenticates your account, you will be prompted to enter in your Master Password to get to your console. [Image] Desktop Downloads: Bitwarden is available as a desktop application for Mac, Windows, and Linux. https://bitwarden.com/download/ Browser Extensions: Bitwarden is available as a browser extension for the following: Google Chrome Mozilla Firefox Opera Microsoft Edge Safari The Current Browser extension integrations process can be found at: https://bitwarden.com/help/article/getting-started-browserext/ Troubleshooting In the event you have created an account with your simpli.fi email address but it is NOT tied to our organization tenant. Then you will need to go through the steps to remove that account so that it can be added back into our tenant. WARNING! if you have any saved passwords/keys/etc you will need to export this data or copy it down because it WILL BE DELETED and you will not be able to recover. https://bitwarden.com/help/delete-your-account/\n\nChild Pages:\n- Bitwarden Guide: Tips for Managing Bitwarden Records (ID: 4542398465)\n\n\nPage Labels: dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3137962030/Bitwarden+Guide+Access+and+Logging+into+with+Okta+SSO", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3137962030", "version": 11, "last_modified": "2025-06-13T20:15:35.753Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "child_count": 1, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
