{"id": "confluence_4081483819", "title": "AWS Key Guide: AWS Key Rotation Guidelines and Best Practices", "content": "The Digital Workplace team's audit of user key rotation in Q3-Q4 2023 highlighted challenges not fully addressed by previous AWS documentation. This led to a re-evaluation of how Simplifi manages AWS access for external clients and internal users , particularly concerning AWS IAM Administration . 🔑 Historical Challenges with User Key Rotation Historically, Simplifi provided AWS access to external clients by adding users to our AWS IAM Administration or, in some instances, by sharing users directly with clients. This approach has presented difficulties, especially with rotating user keys. To maintain compliance with the standards set by one of Simplifi's private equity firms (GTCR), user AWS keys must be rotated every 90 days. This requirement became problematic when managing numerous external client users. 🪣 Recommended Best Practice: AWS ARN for Bucket Policies When granting external clients access to Simplifi S3 buckets, the recommended and most secure approach is to request the client's AWS ARNs (Amazon Resource Names) for the roles they maintain. These ARNs can then be directly added to the S3 bucket policy. This method offers significant advantages over Simplifi maintaining individual users for clients: It eliminates the need for Simplifi to manage and rotate client user keys every 90 days, ensuring ongoing compliance with key rotation standards. It shifts the responsibility of user management and key rotation back to the client, simplifying Simplifi's IAM administration. Future Enhancements and Current Support The Infrastructure Value Stream Team is currently exploring long-term solutions, such as implementing the AWS KWS solution to auto-rotate AWS user keys for both clients and internal users. In the interim, your assistance is crucial in encouraging clients to configure their AWS access at the bucket policy level using ARNs. This collaborative effort helps maintain our security posture and compliance. Additional Context For more context on the key rotation audit , please refer to the following Slack channel: #proj-aws-keys-update .\n\nPage Labels: dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4081483819/AWS+Key+Guide+AWS+Key+Rotation+Guidelines+and+Best+Practices", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4081483819", "version": 7, "last_modified": "2025-06-13T20:41:55.112Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
