{"id": "confluence_5016649760", "title": "AI Usage Policy and Guidelines: Individual Employee Use", "content": "FOR INTERNAL USE ONLY - DO NOT DISTRIBUTE Simplifi empowers employees to leverage Artificial Intelligence (AI) for day-to-day operations to enhance productivity. This document outlines the process and steps required for the safe and compliant use of AI for individual employee use. Adhering to these guidelines helps prevent misuse of company proprietary information and security incidents, ensuring data protection and compliance with legal limits and privacy policies. :question_mark: Support or Feedback For questions, comments, or feedback regarding this AI policy or AI usage, please contact Ryan Falsetti, Privacy Compliance Manager, via Slack or email the Privacy Team at privacy@simpli.fi . The Privacy Team is available to assist with any inquiries related to AI compliance, data use, and security. Mandatory AI Tool Approval Checklist: Before Using New AI Systems Before deploying any new AI system, AI tool, or AI software, employees must complete the following checklist to ensure safe and approved AI usage. This process helps troubleshoot potential compliance issues and data risks. 1. Legal Compliance and Approved Tools Approved AI Tools: Check if the AI tool is already approved for Simplifi use. A list of existing software tools with Embedded AI Tools that are approved at Simplifi can be found [here - link to be inserted]. Unlisted Tools: If an AI tool is not listed on the approved software list, its use is not prohibited automatically. However, you must notify the Compliance Team (via the Privacy Team at privacy@simpli.fi ) about the tool being used for their records. The Compliance Team will then add it to the approved list after review. Legal Expertise & Contract Review: Does the AI tool require legal expertise or involve the review of a contract? If yes, you must follow the AI Use for Enterprise Process. Non-Public Simplifi Information: Will the AI tool process or use Non-Public Simplifi information? If yes, you must follow the AI Use for Enterprise Process. 2. Data Use and Confidentiality Confidential or Sensitive Information: Will the AI process or use any confidential information or sensitive information? Discrimination Risk: Could the AI be used in a way that discriminates based on protected characteristics (e.g., gender, race, sexual orientation, political affiliation)? This includes potential bias in AI-generated content. Action Required for Confidential/Sensitive Data: If yes to either of the above data use questions, immediately email privacy@simpli.fi . Include all relevant information about the AI program and a list of the specific data elements you intend to use. If no to both questions, you may proceed to the next step. Privacy Assessment: Once the Privacy Team reviews the data use details, they will conduct a privacy assessment to identify and mitigate any areas of risk related to data handling and security. 3. Policy Review and External AI Privacy Product Privacy Policy Review: You are required to review the product’s privacy policy for any AI system you intend to use. Warning: Be highly cautious of privacy policies that allow all information entered into their system to be used to train their AI model. This poses a significant data privacy risk. Data Collection & Usage Awareness: Are you fully aware of what data the AI service collects and how that data is used by the third-party provider? Concerns & Assistance: If you have any questions or concerns about an AI product's privacy policy, send the policy to the Privacy Team at privacy@simpli.fi for assistance and review. Employee Liability: Remember, your actions play a direct role in the security of the organization. Depending on the scenario, employees could be held liable for misuse of company proprietary information or security incidents resulting from unapproved or non-compliant AI usage. 4. Review Plan for AI Output Accuracy and Bias Check: Is there a plan or process for reviewing AI-generated content (e.g., AI writing, AI data, summaries, code generation) for accuracy and bias? Understandability & Verification: Is the AI output something you fully understand and can verify for accuracy? This is critical for preventing incorrect information or misleading data.\n\nPage Labels: virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/5016649760/AI+Usage+Policy+and+Guidelines+Individual+Employee+Use", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "5016649760", "version": 3, "last_modified": "2025-06-12T15:24:42.799Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "4428169266", "title": "AI Guides: Approved AI Tools", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
