{"id": "confluence_4185522323", "title": "Apple vs. Microsoft vs. Google", "content": "You may have noticed that, depending on your team, you have varying access or preferences regarding the use of core applications (for things like word processing, number crunching, presentation design, and even… email.) Why is that? [TOC] 1 6 false default list false 📚 HISTORICAL CONTEXT From its inception, Simpli.fi was an Apple-only company in terms of devices. And with Apple Macbook devices came things like Numbers, Pages, Keynote, and Apple Mail. Because these are not standard programs utilized by our clients and vendors, it made sense to have more flexible file formats and compatibility. Simpli.fi thus also had limited licenses for Microsoft Office applications (Excel, Word, Teams.) To remain lean, Simpli.fi experimented with a select number having those applications (based on departmental needs), and tried the open source LibreOffice for all others. Through all of this, Simpli.fi ’s email provider was Google. And with Google Enterprise accounts came access to Sheets, Drive, Docs, Forms, Slides, etc. Google became a great equalizer as it allowed export to formats accepted by Microsoft Office applications of our clients, while allowing us to collaborate internally in the same SaaS solution. (And to be fair, who doesn’t prefer Google Sheets to Apple Numbers?) Over time, Simpli.fi has grown to acquire companies (and their clients) who primarily utilize PC devices and Microsoft applications (e.g., Teams, Outlook, Word, Excel). While these team members continue to use PC devices, we are working as a company to utilize a shared solution in Google Suite. In large part, this is due to the fact that Google Workplace holds our directory of users email accounts and groups. 🔖 SO WHAT ABOUT NOW? Each of these product suites has their advantages, but also have high overlap in functionality. To reduce (1) licensing waste and (2) toil in file compatibility / reformatting, we recommend utilizing Google Suite applications wherever possible. There will be some use cases where Excel is required, for example, by the accounting team. And we acknowledge that some clients simply won’t use Slack to communicate with us (okay, Microsoft Teams it is…). But for the most part, we root for Google Suite (“G-Suite”) options, in no small part due to their: simultaneous, real-time editing , integrated chat collaboration , team groups integrations with Google Calendar, Gmail and Drive, heightened scripting/add-on options for further customization and automation, and integrations with Slack and Slack Workflow Builder If you’re needing some assistance getting Google Suite applications to work like Microsoft Office applications (or otherwise make a case for needing one over the other), consider these resources: [EXPAND: FURTHER READING & RECOMMENDATIONS] Google Sheets vs. Excel: Which is right for you? (Zapier Blog, 2024) Google Slides vs. Keynote vs. PowerPoint (SourceForge, current) Google Workspace vs Office 365: An 8-Point Comparison (CLOUDALLY, 2024) 5 Reasons to switch from Microsoft Office to Google Workspace (PCWorld, 2023) Google Workspace vs. Microsoft 365 (COMPUTERWORLD, 2022) How to make Google Drive apps look and work more like Microsoft Office (PCWorld, 2016) 😖 WHAT ABOUT CURRENT EXCEPTIONS? Microsoft Teams If a client insists that they cannot use Zoom or Google Meet, you are still able to with a free account. If you need to be able to host a teams meeting, or even chat with clients in Microsoft teams, you can submit a request in the Okta Access Request Portal contact the #digital-workplace . Currently, any requester who is not already in the pre-approved Sales team exceptions will have to be reviewed by senior leadership. Microsoft Office If you require Microsoft Office and do not currently have the relevant applications on your machine, please send explanation to #digital-workplace Slack channel or digitalworkplace@simpli.fi . [INFO] The Digital Workplace team is required to help you first discover if your need can be satisfied by existing options in G-Suite. Help us help you (and your coworkers) by identifying needs that we can either better document or troubleshoot. If you happen to have Microsoft Office applications locally on your work laptop, you might notice that they are showing an alert about updates. Our current, limited access to Microsoft 2019 licenses are constrained by their pending termination of support (October 2025). We are discussing options whether to renew static licenses or 📑 WHAT ABOUT FUTURE DEMANDS? The Digital Workplace team is aware that the current licensing structure for Microsoft Office access is not ideal. It’s a headache for administrators to manually manage static license keys; and users cannot easily access online versions of Microsoft Office and choose to update/download locally. We are currently petitioning senior leadership for the option to provide M365 licenses as needed. But our success in getting such a change approved hinges on helping users find options for their needs within G-Suite first. If you believe you have a good case for Microsoft Office access, please don’t hesitate to share with digitalworkplace@simpli.fi .\n\nChild Pages:\n- Customizing Your Inbox: Date Ranges (ID: 3974430828)\n\n\nPage Labels: dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4185522323/Apple+vs.+Microsoft+vs.+Google", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4185522323", "version": 5, "last_modified": "2024-03-29T20:27:11.226Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621814280", "title": "Google", "type": "page"}], "child_count": 1, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
