{"id": "confluence_3620143105", "title": "Initial Setup", "content": "[PANEL] NOTE: This page was made public so that new employees can discover what to expect before they have logged into Okta (and therefore Confluence) for the first time. What is Okta? Okta is an identity and access management platform that allows you to use one password for all your applications with an extra layer of security using multi-factor authentication. Okta is the front door to all your applications. Once you’re in, you’ll see a custom dashboard tailored to have all the applications IT has assigned to you. Click on one and you’re automatically logged in. No need to re-enter any credentials. 1. Account Setup You should receive an email from Okta with the subject line “ [ACTION REQUIRED] Hello from the Simpli.fi Digital Workplace Team!” . This email expires after 7 days, so if you need to have it resent to your mailbox please reach out to the #digital-workplace Slack channel or email digitalworkplace@simpli.fi. After you click ‘Activate Okta Account’, it will open your web browser and ask you to set your password . 2. Authenticators at Setup After you set your password and log into your machine, you will be prompted to setup a second authentication method. Only one is required, but it is highly recommended to have multiple. Okta Fastpass (Most Recommended) \n The preferred Simpli.fi authenticator. Fastpass uses a combination of your TouchID and a local device verification to log you in. This is the easiest method out of the 4 options for logging into your applications. How do I setup Okta Verify? Ensure you have your fingerprint enrolled in your laptop’s TouchID settings ([Image] > System Settings > TouchID) Click ‘ Sign in with Okta FastPass ’ ( you may have to click it twice ) Okta Verify on your machine will open up. Click ‘ Add Account ’ if you do not have Okta Verify on your machine, download and install it Your default web browser will launch and display the Okta login page. Enter your Okta username and click ' Next '. Follow the prompts to sign into your Okta accoun t. After successfully signing in, Okta Verify will open again and prompt you to add your Touch ID with Okta Verify. Follow the on-screen instructions to complete this process. [Image][Image][Image][Image]\n [Image] Okta Verify Mobile App (Recommended) A mobile app that Okta sends a push notification to your phone for you to accept or deny. Okta Verify does not collect information or grant us any access to your personal cell phone data. For more information about what this app does and does not do, please see here: or reach out to the #digital-workplace team. How do I setup Okta Verify? Download the Okta Verify app from your app store. When prompted to setup a verification method, select ‘Okta Verify’ Open the Okta Verify app on your phone Click the ‘+' sign in the upper right hand corner, select ‘Organization’, then 'Yes, Ready to Scan’ Scan the QR code on your computer screen Click ‘Enable’ Done!   Biometric Login (Required for Mac) [Image] If you are using a Mac, you most likely have a fingerprint reader located at the top right. Using your fingerprint allows you to sign into your applications extremely quickly with just the tap of your finger. However, if you choose this method, it is highly recommended to setup a second authentication method, such as Okta Verify to prevent account lock outs in the event you change computers. How do I setup biometric login? When prompted to setup an authentication method, select ‘Security Key or Biometric Authenticator’ When prompted to setup a security key, click ‘Continue’ Tap your finger on the fingerprint reader Done!               Google Authenticator (Not Recommended) [Image] This option you may have already used with previous applications at simpli.fi . It may be a little more cumbersome to use than the above two methods, but it is just as safe and secure. Google authenticator generates a six-digit code you will type into Okta to sign in. How do I setup Google Authenticator? Download the Google Authenticator app from the app store. When prompted to choose your authentication method, select ‘Google Authenticator’ Open the Google Authenticator app on your phone Within the app, press the rainbow plus sign button in the bottom right hand corner, then select ‘Scan QR code’ Scan the QR code with your phone Click ‘Next’ on your computer Enter the code listed under ‘ login.simpli.fi ’ on your Google authenticator app Done!       Finishing Up Once you complete the authenticator setup, you should be led to your end user dashboard or prompted to sign in. Since you are already signed into Okta, you will not need to sign in again to your other apps and can click on them from the dashboard. After you’ve setup these main authenticators, we advise that you also set up We highly recommend installing the Okta browser plug in, which will enable you to quickly access your applications without fully signing into the dashboard. For more information, please see here: Having Issues? If you are having any issues setting up your account, please see . If you are havng issues with Okta Verify, please see . Next:\n\nChild Pages:\n- Dashboard (ID: 3619782687)\n- Okta Browser Plugin (ID: 3619913779)\n- How To Use Okta (ID: 3662577671)\n  - Adding Application Tiles to Your Dashboard (ID: 3945037898) - There are some tools you might use in your day-to-day that are not yet integrated with Okta\n  - OKTA Application Integrations (ID: 3607986225)\n  - Auto-Launching Applications at Okta Login (ID: 4023713921)\n  - Make Okta a \"Desktop Application\" (ID: 4113399845)\n- Authentication Methods (ID: 3620012052)\n  - Giving Okta the Finger (ID: 4024041523)\n  - Okta FastPass Setup Guide (ID: 3779003405) - Okta FastPass allows you to sign in without entering your password\n\n\nPage Labels: public, dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3620143105/Initial+Setup", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3620143105", "version": 21, "last_modified": "2025-02-11T14:39:09.556Z", "author": "Kaitlin Purdham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}], "child_count": 4, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
