{"id": "confluence_4371808263", "title": "Digital Workplace Solutions: Jira Service Desk", "content": "HALP! The Digital Workplace team has historically assisted users through SIX different means: Okta Access Requests Portal Okta Slack App Access Shortcuts #digital-workplace Slack channel digitalworkplace@simpli.fi Email Address workflow-automations-notifications channel (alerts us when there are manual tasks to complete based on workflow triggers with applications that we set in Okta) Individual DMs in Slack (not recommended 😅 ) Help is Here Beginning in Q2 2024, we started integrating our #digital workplace Slack channel with our Jira Service Desk . We did this in order to streamline the various ways we receive requests, but also because of a few added benefits for our customers (employees and contractors like you!): With Atlassian Assist for Jira Service Desk, we can meet people where they like to communicate and automate ticket creation from these messages. We can begin to enforce SLAs to ensure we’re meeting your expectations. We can spot trends in agent activity, reporter activity, applications, and request types that can then inform more strategic changes to our service model. With Atlassian Virtual Assist AI, we can automate the sharing of relevant documentation for initial triage so that you can get what you need sooner (and after hours!). Help is Where? As a result of this, you’ll begin to notice that your Slack messages in #digital-workplace give you the option to create a ticket immediately. Please select this option if you have a need that requires an action from our team (and is not just informational/knowledge-sharing). Once you select the option for a ticket, a 🎫 emoji will appear beneath your Slack message. When an agent wants to help you, you’ll notice they’ll put an 👀 emoji on it. This automatically assigns the corresponding ticket to them and moves it to “in progress” on the SLA clock. If they are needing you or an outside party to take an additional step, the agent may move the issue to pending by adding an ⌛ emoji beneath your original Slack message. This pauses the SLA timer given that the next action is out of their effective control. When an issue is resolved, the agent will put a ✅ beneath your message. This closes the ticket in the service desk. In other words, there’s very little you need to be doing differently; but you should see us improving your experience as we learn from the insights of our service project. [INFO] Can I still use the /access {application} shortcut in Slack or Okta Access Requests? Yes. In fact, you might still get a reminder from our team to submit something with a Slack shortcut or Okta Access Request if it’s a basic access need. But we’ll work on automating those instructions for you so that your experience is a one-stop-shop in our #digital-workplace Slack channel. On the backend, we’ll automate tickets for ourselves if there’s a manual step needed from either of those methods. We want you to use what you find easiest; but we never want you to have to think about where to go to submit a need. Help Us Help You In the coming months, we’ll be building out bot workflows to respond to keywords in your messages. These will share resources and tips with you related to your inquiry. However, it’s not going to be perfect. Like any other language model or human behavior, it benefits from training. Give the bot feedback if it’s not helpful (it will ask!). Heck, give US feedback if we’re not helping you. Anything at all that you’d like to see working differently, let us know. Give us a rating when we close your issue… Leave us a comment in the issue’s thread in Slack… Reach out to digitalworkplace@simpli.fi if there’s something the whole team needs to hear… [TIP] If you ever want to see the aggregated tickets that we receive (especially if searching for other’s who’ve had your issue), you can view the requests in our portal directly.", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4371808263/Digital+Workplace+Solutions+Jira+Service+Desk", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4371808263", "version": 3, "last_modified": "2024-09-19T20:20:46.496Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3492479001", "title": "Atlassian Enterprise Products:", "type": "page"}, {"id": "3493003273", "title": "Jira Enterprise:", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
