{"id": "confluence_5016780813", "title": "Enterprise AI: Implementation and Non-Public Information Usage Policy", "content": "💥 FOR INTERNAL USE ONLY - DO NOT DISTRIBUTE Simplifi recognizes Artificial Intelligence (AI) as a strategic component for developing and improving products, processes, and procedures. This document outlines the essential steps required to implement AI at the Enterprise level or to use AI tools that handle non-public Simplifi information. Adhering to this policy ensures compliance, data security, and proper risk management for all enterprise AI initiatives. :question_mark: Support or Feedback For questions, comments, or feedback concerning this Enterprise AI policy or the AI approval process, please contact Ryan Falsetti, Privacy Compliance Manager, via Slack or email the Compliance Team directly at privacy@simpli.fi . The Compliance Team is available to assist with your inquiries and provide guidance on AI implementation and compliance requirements. Enterprise AI Approval Process This multi-step approval process is mandatory for all enterprise AI projects and AI tools using non-public Simplifi data. Following these steps will streamline AI adoption while ensuring security and regulatory compliance. Step One: Initial Discussion and Request Submission Manager Discussion: Begin by discussing the AI tool and its specific use case with your manager or team lead. Clarify the purpose and benefits of the AI integration. Paid AI Tools: If the AI tool is paid software, obtain manager approval. Your manager must then submit the request to the Procurement team by creating a Jira ticket. This initiates the procurement process for the new AI solution. Free AI Tools using Non-Public Information: If the AI tool is free but will be processing or using non-public Simplifi information (e.g., confidential data, proprietary data, sensitive company information), you must create a Jira ticket. For the \"Project\" field in Jira, select \"Compliance.\" This action automatically kicks off a compliance review for the AI tool and its intended data use. Step Two: Compliance Review and Assessment Forms Compliance Team Contact: After creating the Jira ticket (for either procurement or compliance), the Compliance Team will contact you. Privacy & AI Pre-Assessment Forms: If deemed necessary, you will receive a copy of the Privacy Pre-Assessment form and the included AI Pre-Assessment Form. Completing these forms is crucial for the Compliance Team to understand what data is being used by the AI tool and how it will be processed, handled, and stored. Data Privacy/Security Assessment Determination: The Compliance Team will review the completed assessment forms. Based on this review, they will determine whether a full Data Privacy/Security Assessment needs to be conducted, especially if the AI use case involves high-risk processing or falls under regulations like GDPR and CCPA. Step Three: Risk Assessment and Documentation High-Risk Processing Assessment: If a Data Privacy/Security Assessment needs to be conducted due to high-risk processing (e.g., handling Personal Identifiable Information (PII), sensitive data categories, large-scale data processing), the Compliance Team will conduct this additional assessment with you. This collaborative process ensures all risks are identified and mitigated. No Assessment Required (Documented Justification): If an assessment does not need to be done due to the low nature of the risk, the Compliance Team will produce clear documentation stating that a risk assessment is not required and will explain the rationale. This decision will be documented in Vanta for audit and record-keeping purposes. Step Four: Implementation and Ongoing Management Ongoing Compliance Communication: As you implement the AI tool, it is critical to keep the Compliance Team apprised of any new developments, changes in scope, or unexpected changes related to the AI system or its data usage. Compliance Team Involvement for High-Risk Projects: If PII (Personal Identifiable Information) is being used by the AI tool, or if the AI tool could present a security risk if not implemented properly, you must invite the relevant Compliance Team members to planning and onboarding calls. Their assistance during these critical phases is vital to ensure proper security controls and data governance are in place from the outset, preventing project delays or compliance issues down the line. This proactive engagement is key to successful and secure AI deployment.", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/5016780813/Enterprise+AI+Implementation+and+Non-Public+Information+Usage+Policy", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "5016780813", "version": 3, "last_modified": "2025-06-12T18:08:24.141Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "4428169266", "title": "AI Guides: Approved AI Tools", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
