{"id": "confluence_3969908740", "title": "Okta Login Email Changes", "content": "for non-company-managed applications. If anything needs to change on your email, begin by contacting the Digital Workplace Solutions ( ) team about the change. And we will coordinate with you on an ideal day and time for your schedule. Applications Requiring Manual Steps from You There are a few apps that Okta doesn't manage that you would have to update on your end (if you used your gotoadvantage.com account originally for these). Some examples of apps that are not connected with Okta: Rippling (most people use their personal email to log into this anyway) HSA if applicable (related to Rippling; it is recommended to use your personal email) Fidelity (most people use their personal email for this as well) AppleID (if applicable; not everyone has a Macbook or signed up for Apple App Store) IcePanel (if applicable) Bitwarden (if applicable; it is preferred for you to change your email in the settings so as not to lose any personal use of Bitwarden for passwords.) Browserstack (if applicable, will assist in changing logins for developers) Any app integrations you use for Atlassian ( Jira / Confluence ) need to be re-authorized with the Simpli.fi account. You will be prompted to do so when clicking into a relevant app (e.g., Google Sheets, Scribehow) Outlook (if you use Outlook, please update your Gmail settings accordingly to send from both email accounts). Once logged into Gmail website in your browser, go to the settings gear for user email change) Current Status of User Accounts Transitioned from gotoadvantage Domain In the fourth quarter of 2023, a decision was made to update all gotoadvantage accounts to simpli.fi email domains. This was in part for seamless login experience for the user (fewer credential combinations to maintain, or discrepancies between Okta logins). It was also prioritized due to the pending change from Rippling HRIS to UKG HRIS, effective January 1, 2024. To review current status and scheduled day/time of changes for employees on your team, please see this spreadsheet and related Jira Task .", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3969908740/Okta+Login+Email+Changes", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3969908740", "version": 8, "last_modified": "2023-12-19T21:28:16.422Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3627122699", "title": "Okta Troubleshooting Guides", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
