{"id": "confluence_3938320399", "title": "Signing into corporate apps on a mobile device", "content": "Gmail Open the Gmail app. If you are already signed into your personal account, click on your profile picture and select ‘Add Another Account.’ On the ‘ Set up email ’ page, choose ‘ Google .’ Enter your full email address. You will be redirected to Okta; enter your username (your full email) again. Input your password. You may be directed to the ‘Choose your security method’ screen to select your authentication method, or you will be automatically taken to your Okta Verify Push Notification or Google Authenticator code. Accept the push notification or enter the code provided in the Google Authenticator app. Agree to Google’s terms of service. Allow a few minutes for your account to load. Zoom Launch your Zoom app and click on ‘ Sign In ’ On the following page, choose ‘ Sign in with SSO ’ Input our company domain: “ simpli-fi ” When Okta opens, enter your username (your full email address). Type in your password. You may be directed to the ‘Choose your security method’ screen to select your authentication method, or you might be automatically redirected to your Okta Verify Push Notification or the Google Authenticator code. Accept the push notification or enter the code displayed in the Google Authenticator app.", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3938320399/Signing+into+corporate+apps+on+a+mobile+device", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3938320399", "version": 10, "last_modified": "2025-05-30T12:49:47.774Z", "author": "Kaitlin Purdham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3627122699", "title": "Okta Troubleshooting Guides", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
