{"id": "confluence_4542398465", "title": "Bitwarden Guide: Tips for Managing Bitwarden Records", "content": "Page Directory: Creating new records When creating new records in BW, you can either save them to your personal vault or a shared vault. Browser Extension: From your browser extension, click the '+' sign in the top right Enter the following details: Name: <record name> Username: <username or email associated with login> Password: <enter a password or generate one by clicking the icon> URI: <the url of the website this record is for> Optionally, you can setup an Authenticator Key (TOTP) if you need to use MFA for this account. Clicking the camera icon will scan the QR code for you, or you can manually enter the code. IMPORTANT: scroll to the bottom and set the ownership for this record. If you need to add it to a shared collection, select ‘ Simpli.fi ’ and select the collection(s). Web Page: 1. In the top right, click New > Item Follow the same instructions above Accessing personal records Browser Extension: From your browser extension, click ‘Vault’ at the bottom, then All vaults > My vault Web Page: Under ‘All Vaults’ on the left, select ‘My Vault’ Accessing shared records in a vault You can use the search bar to find all records, or search through the collections: Browser Extension: From your browser extension, click ‘Vault’ at the bottom, then All vaults > My vault Web Page: Under ‘All Vaults’ on the left, select ‘My Vault’ Redeeming free Bitwarden for Families account Bitwarden provides a complimentary family account that can be accessed through your work account. The Bitwarden for Families plan includes: Premium access for up to 6 users Shared collections for family secrets To take advantage of this feature, please follow the steps outlined below: Log in to the Bitwarden web console using the link available in your Okta dashboard. In the left-side menu, select Settings > Free Bitwarden Families . Send an invitation to your personal email. (Note: If you already have an existing Bitwarden account, this will create a new ‘Organization’ under your personal account.)", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4542398465/Bitwarden+Guide+Tips+for+Managing+Bitwarden+Records", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4542398465", "version": 4, "last_modified": "2025-06-13T18:24:41.496Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3137962030", "title": "Bitwarden Guide: Access and Logging into with Okta SSO", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
