{"id": "confluence_3670409217", "title": "Microsoft Office 365 2-Factor Authentication", "content": "Go to Office 365 Login Page : Open your web browser and navigate to the Office 365 login page ( https://portal.office.com ). Enter Your Email : Enter your Simplifi email address and click \"Next.\" Enter Your Okta Password : You will be redirected to the Okta login page. Enter your Okta password and click \"Sign In.\" Authenticate with Okta Verify : You will be prompted to authenticate using Okta Verify. Open the Okta Verify app on your mobile device. Approve the login request via Touch ID / Fingerprint or by entering the code displayed in the Okta Verify app. Phone Verification : If additional verification is needed, Okta will send a push notification or SMS to your phone. Approve the login request via the push notification or enter the code received via SMS. Finalize Setup Complete Profile Information : Complete any additional profile information required by Simplifi Access Office 365 : Once authenticated, you will be granted access to Office 365. Desktop App Sign In Click the sign in option in any of the Microsoft Desktop Apps. When prompted with the Okta sign in page, ebter your credentials and password. When prompted for MFA, FastPass and/or touchID will NOT work. You may need to click the 'Verify with something else link. This should give you other MFA options like Okta Verify or Google Authenticator for your phone. Once you are logged into the desktop app, you will not be prompted again to authenticate. Troubleshooting Tips Ensure App Permissions : Make sure Okta Verify has the necessary permissions on your phone (camera access for QR scanning, push notifications for approval requests). Keep Information Updated : Regularly update your phone number and other contact information in Okta to avoid issues with authentication. Contact IT Support : If you encounter any issues, you are welcome to contact the Digital Workplace team in our Slack channel or service desk (see: https://simplifi.atlassian.net/wiki/x/B4CUBAE )\n\nChild Pages:\n- Intune Enrollment - End User Guide - Win 11 - Register (ID: 3687546881)\n- Intune Enrollment - End User Guide - Win 10 - Register (ID: 3687514113)\n- How to join a Teams meeting (ID: 4132929582)\n- 🛠 Microsoft Office for Mac – Quick Setup & Fixes (ID: 5186879505) - Last updated: April 2025 Hey there! If Microsoft Office is giving you trouble, start here\n", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3670409217/Microsoft+Office+365+2-Factor+Authentication", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3670409217", "version": 5, "last_modified": "2024-07-25T18:03:53.829Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "child_count": 4, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
