{"id": "confluence_3620012052", "title": "Authentication Methods", "content": "Skip to: How do I set an authentication method after I activated my account? [Table of Contents] Okta Verify (Highly Recommended) Okta Verify is a multi-factor authentication (MFA) tool offered by Okta that enables users to approve or deny attempted logins with their smartphone. \n What it does: adds an extra layer of security to user login by requiring a second form of authentication in addition to a password gathers IP address and approximate location only when using the app What it does NOT do: access or collect any personal information on the device \n How do I setup Okta Verify? On your laptop, when prompted to setup a verification method, select ‘Okta Verify’ On your phone, download the Okta Verify app from your app store and open the app. In the app, click the ‘ + ' sign in the upper right hand corner, select ‘ Organization ’, ‘ Skip ', then ' Yes, Ready to Scan ’ [Image][Image][Image][Image] Scan the QR code on your computer screen [Image] On your phone, it is suggested to NOT ‘Enable FaceID Confirmation’ [Image] I recently purchased a new phone and can’t get into my Okta account. What do I do? Please contact the #simpli-okta or #digital-workplace channel for assistance. Okta FastPass (Highly Recommended) Please see Biometric Login (Recommended) [NOTE] TouchID login is only available on Chrome and Safari. For more information, please see https://support.okta.com/help/s/article/Which-Browser-supports-Apple-TouchID-as-WebAuthN-factor?language=en_US[Image] Biometric login for Okta refers to the use of biometric authentication methods, such as fingerprint or facial recognition, as a second factor of authentication in addition to a password. If you were issued a Macbook, you can use the fingerprint reader to meet this requirement. If you have not previously setup your fingerprint reader (Touch ID) for use on your mac, go to your System Preferences > Touch ID > Add Fingerprint. If you need further assistance with this, please reach out to Desktop Support. How do I setup biometric login? When prompted to setup an authentication method, select ‘Security Key or Biometric Authenticator’ When prompted to setup a security key, click ‘Continue’ Tap your finger on the fingerprint reader Done! Google Authenticator (Not Recommended) Google Authenticator is a mobile app that generates time-based one-time passcodes (TOTP) for use in two-factor authentication (2FA) processes. The app generates a new passcode every 30 seconds, which can be used to log into an account on a new device or after a password reset. This method may be more cumbersome to use than the others. [Image] How do I setup Google Authenticator? Download the Google Authenticator app from the app store. When prompted to choose your authentication method, select ‘Google Authenticator’ Open the Google Authenticator app on your phone Within the app, press the rainbow plus sign button in the bottom right hand corner, then select ‘Scan QR code’ Scan the QR code with your phone Click ‘Next’ on your computer Enter the code listed under ‘ login.simpli.fi ’ on your Google authenticator app Done! How do I setup an authentication method after I activated my account? Log in to your Okta dashboard ( https://login.simpli.fi ) . Navigate to the Okta settings page (top right, under your name) Under ‘Security Methods’ you can setup, reset, or remove your authentication methods. Choose your desired security method and follow the instructions above. Next:\n\nChild Pages:\n- Giving Okta the Finger (ID: 4024041523)\n- Okta FastPass Setup Guide (ID: 3779003405) - Okta FastPass allows you to sign in without entering your password\n", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3620012052/Authentication+Methods", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3620012052", "version": 21, "last_modified": "2025-03-17T20:51:40.379Z", "author": "Kaitlin Purdham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3620143105", "title": "Initial Setup", "type": "page"}], "child_count": 2, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
