{"id": "confluence_3959324678", "title": "Disrupting the Infinite Okta Sign-On Loop", "content": "Have you ever felt like you’re getting the worst kind of deja vu when you try to log into Okta? [Image] First Line of Defense: Shutting Down Your Browser Completely shut down Chrome or Firefox. (Please DO NOT simply click the red ' x ' as this does not completely shut down the browser.) [Image] Often, this will fix the issue without having to lose any of your browser history. If the issue resolves, you can stop at this step. 🙂 Note: If you have not setup touchID with your Macbook, check these steps on how to configure. One touch with your finger and you can log into your Mac AND all your Okta apps. Instructions for Further Troubleshooting Be sure you are logging in at http://login.simpli.fi/ If you are using a password manager like 1Password, disable it for this site. Alternatively, manually copy/paste the Okta password from 1Password into Okta. [INFO] When disabling 1Password for the Okta site (whether login.simpli.fi or simpli.okta.com ), you can allow Google Chrome Password Manager to save your password instead. Okta is friendlier with Google Chrome Password Manager than it is with 1Password at this time. If it appears to only be impacting the experience in Chrome, clear your browsing data for at least 7 days in Chrome settings. (You can go back further if needed as shown below.) [Image] If clearing the cache doesn’t seem to resolve the issue, try rebooting your computer. In the top right of your Chrome browser, look for a small Okta icon Click on the icon for the dropdown menu. Click the person icon here and you should see your account listed. [Image][Image] Click on the link to open a new connection and log in. Note: This toolbar icon for the Okta Chrome extension is a quick way to access all of your apps. We do recommend that you sign in first. This Okta Chrome extension allows you to sign in once and you will not be prompted to sign in for the rest of your day. Preventative Medicine In order to prevent this from happening again, be sure to check the Keep me signed in option. [Image] Make sure your Chrome browser is up to date. Sometimes you may see an icon in the upper right hand corner letting you know a Relaunch is needed. [Image] Please do not ignore these update messages for an extended period of time. These patches often times fix known bug issues and also reduces our security exposure with vulnerabilities. Even if you do not see this label, often times updates are still needed. You can check that by going to /Settings / About Chrome. ( See also, documentation of steps from Google .) [Image] Once you have cleared your cache and ensured all updates are applied. Close any open tabs you have open for Simplifi’s Okta page and then reopen at http://login.simpli.fi/ . If Chrome is still having issues, Safari or Firefox will work with out any issues. As always, if you need further assistance, reach out in the Digital Workplace Slack channel . Note: If you have not setup Mac’s touchID setting, we HIGHLY recommend you do this. It is a fast and easy way to log into your Macbook and your Okta account with just the tip of your finger. No need for username/pw or even finding your phone to get a code or Push notification. Look for this circle on the power button. [Image] Here is the link on how to set touchID up with your macbook. [Image] There is an Okta icon in your Chrome toolbar for quick and easy access to ALL your apps? If you don't see it, click the puzzle piece then click the pin next to Okta Browser plugin. From here you can quickly log in to your account and quick access to ALL your apps!   [Image]   [Image]       [Image]", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3959324678/Disrupting+the+Infinite+Okta+Sign-On+Loop", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3959324678", "version": 24, "last_modified": "2024-07-22T20:05:55.769Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3627122699", "title": "Okta Troubleshooting Guides", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
