{"id": "confluence_3767927157", "title": "Seamless.AI", "content": "The Seamless.ai application is integrated with Simpli.fi’s Okta environment. If you do not have a Seamless.ai tile on your Okta Dashboard, please follow these steps to request application access. [INFO] If you are an administrator for the Seamless.ai applications, please see the administrator documentation here . Instructions Once you request access, you will be sent an email invitation from the Seamless app. Please accept this email in order to activate your account FIRST, BEFORE clicking on the Okta Tile. DO NOT TRY TO LOG IN VIA GOOGLE. THIS WILL CREATE AN ACCOUNT NOT ASSOCIATED WITH OUR TENANT AND A SUPPORT TICKET WILL NEED TO BE CREATED WITH SEAMLESS IN ORDER TO REMOVE. To navigate to the application, log in at login.simpli.fi and click the Seamless.ai tile. You can login directly from the application's sign in page as well. http://login.seamless.ai/login From here, you would choose the Login with Okta option. [Image] Click the Using a custom Okta Domain link here. [Image] type in login.simpli.fi and click Sign in. [Image] Once your account is activated, check to make sure you have your credits applied. If not, the Digital-Workplace team will apply them once your account is activated. If you need any further assistance, contact the Digital Workplace team directly in the #digital-workplace Slack channel. NOTE : You may see a different screen than above. If you see this screen, click “ Agree and Continue ” [Image]\n\nPage Labels: seamless, dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3767927157/Seamless.AI", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3767927157", "version": 12, "last_modified": "2025-03-06T20:16:25.869Z", "author": "Rodney Estrada", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "child_count": 0}}
