{"id": "confluence_4238868513", "title": "Welo Introduction", "content": "Welo Skill Introductions Welcome to Welo Welo basics User Types: Guests/Members/Moderators Logging in Logging off Audio on/off Video on/off Sound on/off Sharing screen Video in avatar Room Navigation Moving to a room Inviting someone to a room Knocking on a room Locking a room Stacking users Room resources Share Miro board Share other links Tools Ask Everyone to Join You Start room timer Start Space timer Breakout into rooms Using Zones to communicate via presence Seeing activity (talking/video) I’m present and engaged I’m away I’m not to be disturbed I’m open Make the space yours Renaming a room Use instead of zoom or slack for quick huddles Standing team meetings Quick huddles Google and Slack integrations It is strongly recommended that you integrate both Google and Slack with your Welo account Google Calendar Integration Enables others to see your local time zone and public calendar when they hover over your avatar Slack Integration Enables the saving of direct messages between 2 users (if both have their integration turned on) Resources Recording of our Voltron Kickoff https://drive.google.com/file/d/1px0d94ye5Sur6ZD4Rc6ZE64tRZzwxf2B/view?usp=drive_link Welo Admin and User Guide https://docs.google.com/document/d/1AvgkQM1pIEZm6DANecBkjWT376-my8CM1qVwYcZTCOw/edit#heading=h.6uv07lns6082 FAQ Can I raise my hand in Welo? Right now, there is no persistent hand raise feature in Welo (like what exists in Zoom) To simulate this, you can use the emoji icon for wave to signal that you would like to speak [Image] How do I handle communicating presence with my team? Through your team-based welo etiquette document How can I pin a Miro to a room? How do I put participant video into their avatars? How does messaging work? How do I locate a user who is online? Click on the people button on the navigation UI Find the user you want by scrolling users or searching people Click on the 3 dots “…” Click on “Locate User” [Image]\n\nPage Labels: virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4238868513/Welo+Introduction", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4238868513", "version": 11, "last_modified": "2024-05-06T21:39:45.754Z", "author": "Isaac Garcia", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3723363561", "title": "Welo (Pilot)", "type": "page"}], "child_count": 0}}
