{"id": "confluence_4221173778", "title": "Adobe Stock Guide: Logging into Adobe Stock with Okta SSO", "content": "This is a step-by-step guide for logging into Adobe Stock using Okta and Single Sign-On (SSO). 🔐 Enhanced Security with Okta SSO At Simplifi, we prioritize security by leveraging Okta SSO for accessing platforms like Adobe Stock. This method provides significantly enhanced security compared to the less secure AdobeID, which relies on traditional username/password authentication. While Adobe fully supports Okta authentication, the actual login process starts on the Adobe side. For your convenience, an Adobe application tile is available on your Okta dashboard, designed to take you directly to the login page. :steps: Steps to Log In to Adobe Stock: Access Okta Dashboard : First, log into your Okta dashboard by navigating to login.simpli.fi . Use Adobe Bookmark Tile : On your Okta dashboard, find and click the bookmark icon tile for Adobe. This tile will take you directly to the Adobe Stock login page. [Image] 👀 Initiate Sign-In : This will lead you to the Adobe Stock home page. Click \"Sign In\" in the top right corner. [Image] :email: Enter Simplifi Email : On the subsequent sign-in page, type your Simplfi email address into the designated field. Then, click \"Continue.\" [Image] 🏢 Select Company or School Account : A new page will appear. You might see a similar view or only the \"Company or School Account\" option. Click \"Company or School Account\" to proceed with the Okta authentication flow. [Image] After completing these steps, you should be successfully signed into your Adobe Stock dashboard , granting you full access to the application. :troubleshooting: Authentication & Troubleshooting Okta Prompt : If you're not already signed into Okta and access the Adobe Stock login page directly, you'll be prompted for your Okta credentials. MFA Prompt : There might be times when you're prompted for MFA (Multi-Factor Authentication), even if you're already signed into Okta. This is a normal part of Adobe's session cookie processing and helps maintain a secure connection for your Adobe Stock session. [Image] There is an Okta icon in your Chrome toolbar for quick and easy access to ALL your apps? If you don't see it, click the puzzle piece then click the pin next to Okta Browser plugin. From here you can quickly log in to your account and quick access to ALL your apps!   [Image] [Image]       [Image]\n\nPage Labels: dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4221173778/Adobe+Stock+Guide+Logging+into+Adobe+Stock+with+Okta+SSO", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4221173778", "version": 7, "last_modified": "2025-06-13T20:40:37.831Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "4203053083", "title": "Adobe Enterprise Products: Guides for logging into Adobe applications", "type": "page"}], "child_count": 0}}
