{"id": "confluence_3723363561", "title": "Welo (Pilot)", "content": "https://www.welo.space/ Welo is currently a pilot being tested by the Agile Coaches. If you would like to join the pilot or experience the space, please reach out to [Image] The virtual office solution for remote and hybrid teams Welo’s visual spaces recreate the look, feel, and flow of working together in-person. Connect and collaborate together in a customizable online office, integrated with your favorite tools. New Welo Users https://www.welo.space/wp-content/uploads/2024/04/Welo-how-to-accepting-a-member-invitation.pdf https://drive.google.com/file/d/1TcJH90GctSE89oDq1n6iuM-qRO-oUpQR/view Welo Guide Each community and each coworking space will develop its own rules and norms. We would like to share certain things that seem to be working for us. We would love to see you at some point in the Welo space, whether coworking (as in, being in close proximity to people not working with you, while you’re carrying out your work) or during one of our meetings/activities. So we hope that this guide to our coworking space will help you to feel more settled in. See you there! https://miro.com/app/board/uXjVM2OzKLM=/ https://vimeo.com/824802079 https://vimeo.com/833805627 Using Rooms When you arrive in the Welo space, you are automatically placed in the reception area as it has been designated by the team. To navigate from room to room, you just double click on the room you want to go to. The names of the rooms can change and if renaming a room will help you and your team have a better co-working experience, right click on a room to “Change Room Settings” and update the label. When you enter a room, you may or may not see and hear others, depending on whether a zoom meeting is activated for that room. If you want to start a zoom meeting in the room you are currently in, you can “Start a Call” [Image] Coworking in a Room Feel free to just say “Hi” and then get on with the work. There is no expectation that you will have to have a conversation with the people in the room. (Though if you really don’t want to converse/hear/see others, place yourself in the Quiet Room.) If you’re not sure whether you are interrupting a meeting or whether you are disturbing someone by entering into their room, you can Knock on their door. If you really don’t want anyone to join you in a room (eg you are doing deep work or having a meeting), place yourself in a room with walls and Lock the Room (right click the room to access this option).​ [Image] Room Etiquette “Very focused” When you find yourself very focus and don’t want to be disturbed, but still want to feel like you’re in the space with other people, place yourself in a “Very focused” room. Don’t message or start a meeting in rooms that are for deep focus. “Quiet room” Please keep chat conversations short and don’t start meetings in these rooms. “In the mood to chat” When you are taking a break and feel like chatting, place yourself in a space without walls or in an the “In the Mood to Chat” room. Feel free to chat and even start a meeting with people in these spaces. “Back later” When you are about to leave for a while but plan to come back, put yourself in the Back Later room. “Private Meeting” When two or more people want to have a conversation, but don’t want to be disturbed they can place themselves in this room and lock the room. Communicating Across Rooms If someone is in a separate room and you want to send them a message, you can right click on them and select “Send Message” (be mindful of which room they are in and if they should be send a message). If you want someone to join you in a room, right-click and “Ask to Join”. If you send a request to join to someone, they can Decline it if they’re busy or they can Accept it, in which case they’ll join you in your room. Potential Use Cases Virtual Dev Summits Open Space or Lean Coffee events Practice Open Houses Synchronous Donut Pairing Social/Happy Hour Lunch Room Lunch & Learn/Brown Bag Cookies for Coders Co-Working Being “in-office” (Virtually Present) On Call Space Team Development Space War Room Space Other Resources https://docs.google.com/document/d/1AvgkQM1pIEZm6DANecBkjWT376-my8CM1qVwYcZTCOw/preview#heading=h.1zusqpsbm9gc https://miro.com/app/board/uXjVM2OzKLM=/\n\nChild Pages:\n- Welo Introduction (ID: 4238868513)\n- Template Welo Etiquette (ID: 4254695462)\n- Voltron Welo Etiquette (ID: 4259578135)\n\n\nPage Labels: virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3723363561/Welo+Pilot", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3723363561", "version": 10, "last_modified": "2024-12-17T16:35:34.124Z", "author": "Isaac Garcia", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "child_count": 3}}
