{"id": "confluence_3949101175", "title": "Creating Slack Connect Channels", "content": "Needing a way to maintain tighter feedback loops with clients? Finding yourself wishing you could have threaded conversations with vendors? Slack Connect functionality allows you to create internal Slack channels and invite external stakeholders to them. [INFO] If you need to have a Slack Connect channel available in both Slack workspaces, please contact Digital Workplace ( Slack | Email ) for assistance. 📺 Video Tutorial [Image] 📖 Instructions In Slack’s left-side menu bar, select the drop-down menu for Channels . Select Create > Create Channel. Choose the workspace that will house the channel, whether Simpli.fi (for all employees) or Simpli.fi Engineering (if you’re in Product, AdOps, Business Development, or Development teams). Click Next. Type the name you would like to provide for the channel; click Next. Determine whether you would like the channel to be Public or Private ; click Next. When prompted, add people to the channel. When you start typing, names from internal users will populate. However, at this step, you can also type entire email addresses for external users you would like to invite. When you have entered all names of internal users and external users; click Next. Remember, you can always add users later after the channel is setup (you have the option to click Skip for now .) Once the prompt box parses that you have provided emails with external domains, it will ask if you want to add the external users to your organization, or whether you would like to create a Slack Connect channel with those users. Please select the Slack Connect Channel as not everyone can manage/maintain guest accounts in Slack. Note whether you would like your external users to have the Invite and post permission or the Invite only permission set based on whether you’ll be needing external stakeholders to invite their peers. [NOTE] Keep in mind, Slack administrators will get alerts for any invitations whereby an external user invites a Simpli.fi email address to their Slack Connect channel, or whereby a Simpli.fi employee has invited an external user to a Slack Connect channel in our workspace(s). Provide details (if desired) for your invitation message to the external users and send. Once your channel is created, you will notice that your external users are not automatically added to the channel. They must accept your channel invitation. You can add more external users to the channel via the same mechanism for adding internal users. Select the drop-down menu by the channel’s name. Navigate to the Members tab. Click Add people . Type in the external user’s email or the internal user’s name as prompted. You can manage or revoke invitations by navigating to the Connections drop-down menu in the left-side menu of Slack. Select Manage. Click Browse Slack Connect . In the upper right corner of the Slack Connect home, you’ll see View Invitations . Click the Sent tab. Hover over the right side of the email/name to see an option to revoke the invitation if needed.\n\nPage Labels: dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3949101175/Creating+Slack+Connect+Channels", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3949101175", "version": 2, "last_modified": "2023-11-02T23:43:55.862Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3492511793", "title": "Slack", "type": "page"}], "child_count": 0}}
