{"id": "confluence_3892903976", "title": "Okta Password Reset", "content": "If you’re ever embarrassed by being locked out of your Okta portal, or hesitant on whom you should ask for help when forgetting your Okta password? Fret no more! You are able to reset your Okta password at any time, provided you have access to Slack. Here are some steps you can take… Steps to Reset Your Password: Okta Slack App Add the Okta app to Slack by clicking on the Apps section of your Slack sidebar menu. Click Manage > Browse Apps In the Apps search bar, type Okta . Add it to your Slack Apps (it has already been configured for access and is available to employees in both Slack workspaces). It should now appear in your Slack sidebar. When you to reset your password, simply click the Okta app under your Slack sidebar Apps section. From the drop-down menu of self-service options, select Okta Password Reset. Enter your company email in the User Email field in the prompt. Click Submit . Steps to Reset Your Password: Slack Shortcut From any message box in Slack, enter the following shortcut /access Okta Password Reset For example, if you’re about to type in the Digital Workplace Slack channel , instead of typing your need, enter the above command. [Image] Once you’ve typed it, press the send button. You will then be re-directed to complete steps to provide information for the reset. To proceed, click Continue . Enter your company email address in the field when prompted, and click Submit. [PANEL] Friendly reminder that there are many self-service access options resolved by utilizing the Okta Access Request portal ! You obviously cannot use that if you’re unable to login to Okta (as in the case above). However, it’s there for other access needs, and is what determines the Access Request choices you have available in the Slack app and Slack shortcut. See instructions here!\n\nPage Labels: dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3892903976/Okta+Password+Reset", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3892903976", "version": 1, "last_modified": "2023-09-15T20:22:22.537Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3627122699", "title": "Okta Troubleshooting Guides", "type": "page"}], "child_count": 0}}
