{"id": "confluence_3758620708", "title": "Zoom License & Login", "content": "[TOC] 1 6 false flat pipe false Introduction We use Zoom for internal meetings, client meetings, and webinars. Most employees have a basic license (40 minute meeting time limit) managed by Simpli.fi ’s enterprise account. Given that sales team members and executive team members frequently host longer meetings, they have a fully licensed account by default. Logging Into Zoom Due to a security flaw identified with Gmail logins in December 2023, Simpli.fi employees can only log into Zoom via Okta SSO. Here are three ways to log in: The Zoom application tile within  the Okta portal  ( preferred ) Log into Okta . Click the Zoom application tile in your portal. If for any reason it doesn’t automatically log you into Zoom, click the SSO login option. This will then verify with Okta and pass you through to your Simpli.fi Zoom account. The Zoom application on your phone ( provided you have Okta Verify or Google Authenticator on your phone for authentication purposes ). You’ll want to verify the phone application through the following steps; and it should keep you logged in for quite some time on your phone. Open your Zoom app and select Sign In. On the next screen, select Sign in with SSO. Enter our company domain simpli-fi so it looks like this simpli-fi.zoom.us Once Okta opens, enter your Okta username (full email). Enter your Okta password. You might be sent to the Choose your security method screen to pick your authentication method; or you will be automatically redirected to your Okta Verify Push Notification or Google Authenticator code. Accept your push notification or enter the code provided in the Google Authenticator app. The SSO Key option  when logging into the Zoom site  directly. Go to the Zoom site login screen. Select the SSO login option [Image] Ensure you are typing simpli-fi into the URL prompt [Image] Click Continue . Enter your Simpli.fi email into the Okta login screen for your username. Continue to verify with your preferred method. You should then be redirected to the Zoom application. Upgrading Your Account [NOTE] If you need to record your meeting to the Zoom Cloud, a license is required. If needed, request a Zoom license in #digital-workplace. Due to company policy, we do not permit local recording; and basic accounts do not have the ability to record to the cloud. Employees who frequently need meetings longer than 40 minutes, or who need to record to the Zoom Cloud, can ask for an upgrade: HQ Zoom Meetings If you utilize on-site conference rooms, you may recall that some of them (like Alligator or the Board Room) had built-in systems wherein you would need to log into a computer to be able to host remote/hybrid meetings. This should no longer be the case and therefore should not need Okta login. To ensure the ability to host a Zoom meeting: Ensure the room is included on your calendar invitation (that also includes your Zoom meeting details) When you’re ready to start your meeting in the room, tap the button on the tablet to initiate hosting the meeting The meeting’s equipment becomes the host of the Zoom meeting, allowing you Zoom controls. Shout-out to for thinking of the on-site user’s experience and providing these instructions. Troubleshooting If you are having trouble logging into your Zoom application on your desktop client, the web app, or verifying it on your phone app, please ensure you are using the simpli-fi as the base for the Zoom URL ( simpli-fi.zoom.us ). If you have a legacy Bidtellect Zoom account, for resetting your Zoom Chrome extension. 🗓️ If you’re having issues with Google Calendar not accepting your Zoom link, please go to your Zoom profile settings and reauthorize your calendar as seen here… [Image] [PANEL] Hitting other issues? Drat. We try to avoid that. Ping the #digital-workplace Slack channel or reach out via email . Don’t hesitate! (We love to help!)\n\nChild Pages:\n- Incorrect Zoom Account (ID: 3757736109) - Bidtellect default when trying to create a new meeting invite\n\n\nPage Labels: dws-user", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3758620708/Zoom+License+Login", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3758620708", "version": 13, "last_modified": "2025-03-18T18:56:03.561Z", "author": "Rodney Estrada", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "child_count": 1}}
