{"id": "confluence_4860641295", "title": "Hoxhunt Security Awareness Training", "content": "Welcome to the Hoxhunt Security Awareness Training program! This page provides additional details about the program, including its purpose, how to engage, and where to get help. Please feel free to reach out with any questions or feedback. Why We’re Using Hoxhunt In today’s digital landscape, phishing attacks are one of the most common threats organizations face. While we have implemented various security measures, human vigilance remains a critical line of defense. Our previous phishing simulation training was basic and did not provide meaningful feedback. Hoxhunt offers a more engaging and effective solution that helps: Empower employees to recognize and report phishing attempts. Provide real-time feedback on whether a simulation was passed or failed. Create a gamified learning experience to improve our overall security posture. This enhanced training will better equip all of us to protect sensitive data and maintain trust with our clients. How to Engage with Hoxhunt Engaging with Hoxhunt is simple and rewarding! Here’s how you can participate: Watch for Emails : Periodically, you’ll receive simulated phishing emails from Hoxhunt. These will look like real phishing attempts but are part of the training. Report Suspicious Emails : Use the Hoxhunt button in your email client to report any email you suspect as a phishing attempt. Learn from Feedback : After reporting, you’ll receive immediate feedback on whether you correctly identified the simulation. If not, you’ll see tips to help you improve. Track Your Progress : Log in to the Hoxhunt platform to view your progress, earn badges, and learn more about phishing prevention. How to Get Help If you have questions or need assistance with Hoxhunt, the Digital Workplace team is here to help. You can reach us by: Slack : Message the #digital-workplace channel for quick assistance. Support Portal : Submit a ticket through our internal support portal . Who to Contact with Questions The Digital Workplace team is your primary point of contact for anything related to Hoxhunt. Whether you need technical support, have questions about the training, or want to provide feedback, please don’t hesitate to reach out. Slack Channel: #digital-workplace FAQs What happens if I fail a phishing simulation? You’ll receive immediate feedback on what to look out for and tips to improve. Remember, this training is about learning, not punishment. Will my results be shared with my manager? Individual results are private and are used to help you improve. However, Hoxhunt includes leaderboards as part of its gamification features, which display overall performance rankings within the organization. How often will I receive phishing simulations? Simulations will be sent periodically throughout the year. The exact frequency may vary. We’re excited to launch this enhanced training program and look forward to seeing the positive impact it will have on our collective security awareness. Thank you for your participation and commitment to keeping our organization safe!", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4860641295/Hoxhunt+Security+Awareness+Training", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4860641295", "version": 1, "last_modified": "2025-01-07T18:12:41.925Z", "author": "Tommy Mills", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "child_count": 0}}
