{"id": "confluence_3619913779", "title": "Okta Browser Plugin", "content": "[PANEL] NOTE: This page was made public so that new employees can discover what to expect before they have logged into Okta (and therefore Confluence) for the first time. The Okta Browser Plugin is a quick and easy method for logging into your apps without having to sign into the application dashboard. To download the plugin, please click on this link: https://chrome.google.com/webstore/detail/okta-browser-plugin/glnpjglilkicbckjpbgcfkogebgllemb?hl=en [Image][PANEL] Use cmd+shift+o and type in the application name to automatically jump into the tool! Plug in needs Reinstalled: If your Chrome browser loses your Okta Plugin, you may find that you need to add it back to your browser. This sometimes occurs after a system or browser update. [Image] Click the Install button and it will take you to the Google store. [Image] Click Add to Chrome. Refresh your Okta Dashboard and your apps should go back to working properly. We highly recommend ‘pinning’ your plugin extension on your browser so that it always shows in the toolbar. Click the puzzle icon shown below and then click the pin next to Okta Browser plugin. Hint: you can do this for any plugin extension that you use often or need quick access too. Check to make sure your plugin is logged in by clicking on the icon in the toolbar. see gif at top of page. If you get a sign in button like below. Try signing completely out of your Okta Dashboard, then sign back in, it should connect your plugin back. [Image] Verify that you are also connected to login.simpli.fi and NOT simpli.okta.com [Image] If it shows simpli.okta.com technically it will still work, but there may be some instances that you get prompted for MFA again even though you are already signed in and authenticated. To fix this, click the gear icon and scroll to the bottom of the page. Click Reset Plugin button. [Image] Sign out of your Okta Dashboard and make sure you are signing in at login.simpli.fi and sign back in. The plugin should sign in you automatically. If it doesnt and you keep having issues, reach out to a team member in the #digital-workplace channel in Slack.\n\nPage Labels: public, dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3619913779/Okta+Browser+Plugin", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3619913779", "version": 6, "last_modified": "2024-08-22T20:33:40.288Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3620143105", "title": "Initial Setup", "type": "page"}], "child_count": 0}}
