{"id": "confluence_3869573147", "title": "Accessing Bidtellect Looker", "content": "The Bidtellect Simpli.fi team hosts their own Looker solution on premises. Because it is an application protected by VPN access, we advise the following steps for Simpli.fi employees when utilizing: [TOC] 3 3 false list false Log into Okta When in doubt about how best to access company tools, think Okta as the origin. if doing so for the first time. [PANEL] Remember to setup your authenticators (we recommend the Okta Verify app ) and utilize the Okta Browser Plugin for seamless, secure access. Access P81 [NOTE] If you do not see the Perimeter81 tile in your Okta dashboard, you can request access by either visiting the Okta Access Request tile in your Okta portal, Slacking the #digital-workplace team , or typing /access Perimeter 81 in a Slack message to automatically submit a request for access to BT_Tools Once you’re logged into Okta, you can access P81 either from your: Browser Application Portal Tile [Image] Browser Plugin [Image] Access Bidtellect Looker via Perimeter 81 When clicking on the P81 tile in Okta for the first time, you will be prompted to download the Okta application. If for some reason you are not prompted, you can download the desktop agent here . [INFO] Note, if it prompts you for the workspace URL, this would be simplifi (e.g., simplifi.perimter81.com ). It is HIGHLY RECOMMENDED that you install the P81 agent on your Macbook. This will help you to stay connected to the VPN for longer periods of time. Once you go through the steps to download the P81 agent, you may receive a window about the System Extension Blocked . If you receive this alert, you MUST approve the security settings to allow it access. Otherwise, it will not function. If you do not receive this window, you should be set to login to Bidtellect Looker. But you can always go to your System Settings and look at your Privacy & Security section. [Image] You should be able to access Bidtellect Looker once you have logged into Perimeter 81 (P81) and have been added to the BT_Tools group. You’ll simply open looker.bidtellect.com in the browser window of your choice, log in with your Looker credentials, and voila! Here is a sample walk-through of an employee logging into P81 and Bidtellect Looker for the first time after receiving the application in Okta. [INFO] If you do not have password credentials for Bidtellect Looker, ask your team if a shared login is available. Otherwise please contact . The video below states Jason Taylor, but that is an error.[Image] Troubleshooting If you need further assistance on how to use Bidtellect’s Looker solution, please see these helpful notes within the Bidtellect Confluence Space . Additionally, don’t hesitate to contact the #digital-workplace team with any issues. [NOTE] Some Simpli.fi Mac users have found they cannot access Bidtellect Looker through P81 VPN if they are not running the most up to date operating system. Please ensure you have the most recent MacOS. And if you encounter issues with this particular error, please contact the facilities team .\n\nPage Labels: looker, bt-looker, dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3869573147/Accessing+Bidtellect+Looker", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3869573147", "version": 19, "last_modified": "2024-03-08T21:27:50.137Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3847290892", "title": "Looker", "type": "page"}], "child_count": 0}}
