{"id": "confluence_5270044673", "title": "LinkedIn Sales Navigator", "content": "LinkedIn Sales Navigator is a premium sales platform that empowers sales professionals to find, understand, and engage with prospects and customers more effectively. It provides advanced search filters, lead recommendations, real-time insights, and integration with CRM systems, enabling targeted outreach, stronger relationship building, and ultimately, increased sales productivity and revenue. [Image] Simplifi LinkedIn Features Simplifi ensures that every employee has access to the Sales Navigator platform, regardless of their department. This initiative allows all employees to utilize the Premium features available on LinkedIn. Access to the Premium features. The features mentioned are linked to Simplifi’s Enterprise account, which operates through our Okta platform for Single Sign-On (SSO). Your personal LinkedIn account is connected to the company account; however, you will still retain access to your own account using your email and password. The system will confirm your eligibility for the Premium features and may request your Okta credentials upon your initial connection. If you are no longer employed at Simplifi, your access to the Premium features will be revoked. However, you will still have the option to purchase these premium features independently. Steps to complete prior to accepting invite: Log into your personal LinkedIn account. Click on the \"Me\" icon (your profile picture) in the top right corner of your LinkedIn homepage. Click on the Settings & Privacy button. [Image] Click on Sign in & security. [Image] Click on Email addresses. [Image] On the \"Email addresses\" page, click on \"Add email address\" . You may be prompted to verify with a 6-digit pin sent to your current email address. Enter in your simplifi email address along with your LinkedIn password. [Image] Click Submit. LinkedIn will send a verification email to your Simplifi email address. Go to your Simplifi email inbox, open the email from LinkedIn, and click on the \"Verify email address\" link. Once you click the verification link, your Simplifi email address will be successfully added as a secondary email to your LinkedIn account. You can return to the \"Email addresses\" section in your LinkedIn settings to confirm it has been added. Invitation from LinkedIn [Image] Click the Activate your account now button in the email and follow the prompts for setting up your account. This will take you to the Sales Navigator section, but will also upgrade you account to Premium. NOTE: Ensure that your Simplifi email is designated as your SECONDARY email address, rather than your primary one. If your Simplifi email is currently set as the primary, you will need to follow these steps: first, add your personal email as a secondary address. After that, return to the settings to change your Simplifi email back to the Primary.", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/5270044673/LinkedIn+Sales+Navigator", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "5270044673", "version": 2, "last_modified": "2025-05-22T19:52:52.484Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "child_count": 0}}
