{"id": "confluence_4059562091", "title": "Simplifi Training Portal (Formerly Bullseye Training)", "content": "[Image] This document is to guide you through steps for accessing the Simplifi Training program through your Okta Dashboard. This setup is optional, as it it just a way to quickly store your credentials and pass them securely to the application. It also acts as a bookmark for you to easily navigate to the platform. You will still be able to access the same way as before from the login page directly. You should see a Simplifi Training icon on your Okta Dashboard or in your Okta toolbar plugin. (If you are not familiar with the Okta toolbar plugin, check the Did you Know at the bottom of this page) [Image][Image] The first time you click on the Tile, a box may pop up with your username and a password showing ********, This is not going to be the same password that you saved in your training app page. Click the 3 dots in the upper right hand corner of the tile and a sidebar will open on the right. In the lower right hand corner, click the Edit button. This will allow you to set the password that you have created at the training page login. Once you set the password, click the Save button in the lower right hand corner. [Image] If you have forgotten your password, or it is saved in the webpage and you cannot remember it, you can click the forgot password option from the sign in page. Be sure to check your Spam folder if you do not see the email in your Inbox. [Image] What happens when I click the tile? Okta will automatically open a new tab and open the training log in page and securely pass your encrypted credentials into the fields and automatically log you in to the site. No need to enter your password or even the need to click the login button. hint: this will only work if the usernames and passwords match You may already have a tile on your dashboard for the Training app because the plugin popped up a message asking you if you would like to save your log in. It may look similar to the tile below. You can keep this, as it will not interfere with anything but you can delete it if you would like to keep your Dashboard clear of unneeded items. [Image]   [Image] There is an Okta icon in your Chrome toolbar for quick and easy access to ALL your apps? If you don't see it, click the puzzle piece then click the pin next to Okta Browser plugin. From here you can quickly log in to your account and quick access to ALL your apps!     [Image] [Image]       [Image]\n\nPage Labels: dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4059562091/Simplifi+Training+Portal+Formerly+Bullseye+Training", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4059562091", "version": 4, "last_modified": "2024-01-29T19:24:54.708Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "child_count": 0}}
