{"id": "confluence_4064149506", "title": "WEX Sign In Tile for Okta:", "content": "This is the step by step guide for setting up and logging into your WEX account via your Okta Dashboard. This process and usage from the Okta dashboard is 100% completely optional . The Okta tile simply acts as a bookmark and a secure credential store for you and will encrypt your credentials before sending them to the login page. Note: This is safer than sending plain text over the web when signing in directly and putting in your credentials. In the event that you leave the company, you will still have the same access and credentials that you created when signing up. Simplifi nor Okta have access to your credentials and do not handle any account information or passwords. All password resets would be handled on the site page. How to Use: Look on your Okta Dashboard for a new Wex tile like the one below. Note: You may already have a similar tile on your dashboard if you have already signed in and clicked ‘Yes’ to the Okta popup asking you if you want to save your credentials. You can keep both or remove the previous one you have stored. (recommended) [Image] Click the 3 dots on the upper right hand corner and the settings will open to the right. Click the Edit button that is ridiculously all the way at the bottom right side of the page. 🧐 Now you can enter in your username and the password that you set up and click Save all the way in the bottom right. [Image] When you click the WEX tile it will bring you to the first part of the sign in page. You should see your username already filled in the box for you and you will see the page update with password field that will autofill and then should log you in. [Image] [Image] If you have to ever reset your password, be sure to edit your Okta tile and update your new password. Otherwise, your login will fail. ALL PASSWORD RESETS ARE HANDLED ON THE WEX APPLICATION SITE. [Image] There is an Okta icon in your Chrome toolbar for quick and easy access to ALL your apps? If you don't see it, click the puzzle piece then click the pin next to Okta Browser plugin. From here you can quickly log in to your account and quick access to ALL your apps!   [Image] [Image]       [Image]\n\nPage Labels: sales, adobe-sign, dws-user, virtual_agent", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4064149506/WEX+Sign+In+Tile+for+Okta", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4064149506", "version": 3, "last_modified": "2024-02-02T20:20:36.057Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "child_count": 0}}
