{"id": "confluence_3777626137", "title": "Perimeter 81", "content": "What is Perimeter 81? Perimeter 81 is Simplifi’s VPN solution that is broken down by specific networks, where access is maintained by group memberships. Feel free to check out these resources for more detailed information: Tutorials: https://www.perimeter81.com/video#tutorials Knowledge Base: https://support.perimeter81.com/docs via . To do so, they need access to the GCP-PRD network. Additionally, accounting and SWAT team members use the VPN to To do so, they need access to the BT-Tools network. The engineering team largely uses GCP-HA-PRD , GCP-PRD , and GCP-HA-DEV as we are moving away from server solutions with IBM. Though, IBM_SWAT and IBM_VPN are still available during this transition to Google Cloud services. Requirements MAC OS needs to no less than Big Sur, preferably higher ** note: will not install or run from the application page if not updated Windows machines needs to have all updates installed. Okta username/account Requesting Access There are several ways you can request access into the P81 environment. The Digital Workplace team has a built out automated self-service request that allows you to have quick access to the platform. Slack <> Okta Application Request In Slack, search for the Okta app under apps. If you do not see the Okta app, simply click the Add apps option and select the Okta app. Under the Home tab, click the Choose a resource option and choose Perimeter 81 Membership. Slack <> Okta Shortcut Request Alternatively, from within the #digital-workplace channel by typing in the command below directly in the channel… /access Perimeter 81 Follow the prompt to confirm that you would like Perimeter 81 access. In the prompt, enter in your simpli.fi email address and click Submit. Okta Access Request Portal From your Okta dashboard, click on the tile named Okta Access Request. This will open a separate console for you to request the Perimeter 81 app (along with many other apps). Click Request access and you will be prompted with same or similar steps and questions as above. Fill out the request form with your email address only, no other tet or multiple users. Currently, the request can only accept a single network at this time, if you need access to more than one network, please reach out to the #digital-workplace team. Downloading the Harmony SASE (Perimeter 81) App Follow the link below to download the correct install file. https://support.perimeter81.com/docs/downloading-the-agent Once installed, look for the app in your task bar area. Click Sign In . A browser window will open up. Upon first time logging in, if prompted for a company URL, use simplifi .perimeter81.com Click the Sign in with Okta button. If you are already signed into your Okta dashboard, the authentication will be automatic. Otherwise, you will be prompted for your Okta credentials. Click the Checkbox to always allow and click Open Perimeter 81. Once you are successfully logged in, you will be able to see your available networks under Private Networks. along with Quick Access. Troubleshooting Examples Issue resolving DNS names on GCP production. Problem - Able to resolve the FQDN cmak.service.consul, but not just by using cmak. Note: Works correctly on GCP dev and IBM. Possible resolution - P81 support recommended running the following command on MacBooks sudo killall -HUP mDNSResponder Reference tickets: https://help.perimeter81.com/support/tickets/71161 Issue accessing desktop client applications (e.g. Slack) when connected to the VPN: Ticket for issue on December 13, 2024 Troubleshooting in Slack between DW, Infrastructure, and end user (Jason Hatton) Resolution Steps identified by Jason Hatton", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3777626137/Perimeter+81", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3777626137", "version": 13, "last_modified": "2024-12-16T20:56:56.426Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
