{"id": "confluence_3716677646", "title": "Donut Slack App", "content": "https://www.donut.com/ Connect around the watercooler, anywhere Connect serendipitously for virtual coffee, peer learning, birthday and work anniversary celebrations, DEI discussions, and more. We all need friends at work. Having authentic relationships with our colleagues makes us more productive, 7x more engaged, and increases our happiness as much as a $100,000 raise. Over 15,000 teams like Okta, Betterment, Gitlab, Zapier, and InVision have used Donut to make 6+ million connections among teammates across departments, office locations, and continents. Donut makes connections across the organization, for teams of all sizes in three ways: by encouraging in-person or virtual meetups, asynchronous banter, and more festive birthday and work anniversary celebrations. How to join a Donut To join the primary Engineering Donut Join #engineering-watercooler to be automatically added to the Donut rotation Intros every 2 weeks Donut Etiquette If you are unable to regularly join and participate in donuts, consider: Pausing your Donut pairing (instructions) Leaving the Donut channel Come ready to connect and have fun Be present in your conversation Be as vulnerable as possible to put the other person(s) at ease Have your camera on Have some icebreaker questions ready in case the conversation stalls If you identify something about work you need to discuss, consider having another meeting outside the Donut to discuss further (especially if another person is on the call that the work discussion doesn’t apply to)", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3716677646/Donut+Slack+App", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3716677646", "version": 3, "last_modified": "2023-04-12T15:06:59.343Z", "author": "Isaac Garcia", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
