{"id": "confluence_4185522323", "title": "Apple vs. Microsoft vs. Google", "content": "You may have noticed that, depending on your team, you have varying access or preferences regarding the use of core applications (for things like word processing, number crunching, presentation design, and even… email.) Why is that? with a free account. If you need to be able to host a teams meeting, or even chat with clients in Microsoft teams, you can submit a request in the Okta Access Request Portal contact the #digital-workplace . Currently, any requester who is not already in the pre-approved Sales team exceptions will have to be reviewed by senior leadership. Microsoft Office If you require Microsoft Office and do not currently have the relevant applications on your machine, please send explanation to #digital-workplace Slack channel or digitalworkplace@simpli.fi . If you happen to have Microsoft Office applications locally on your work laptop, you might notice that they are showing an alert about updates. Our current, limited access to Microsoft 2019 licenses are constrained by their pending termination of support (October 2025). We are discussing options whether to renew static licenses or WHAT ABOUT FUTURE DEMANDS? The Digital Workplace team is aware that the current licensing structure for Microsoft Office access is not ideal. It’s a headache for administrators to manually manage static license keys; and users cannot easily access online versions of Microsoft Office and choose to update/download locally. We are currently petitioning senior leadership for the option to provide M365 licenses as needed. But our success in getting such a change approved hinges on helping users find options for their needs within G-Suite first. If you believe you have a good case for Microsoft Office access, please don’t hesitate to share with digitalworkplace@simpli.fi .", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4185522323/Apple+vs.+Microsoft+vs.+Google", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4185522323", "version": 5, "last_modified": "2024-03-29T20:27:11.226Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621814280", "title": "Google", "type": "page"}], "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
