{"id": "confluence_4893769745", "title": "DocuSign CLM: DocuSign Edit App", "content": "As part of DocuSign CLM, you can easily edit DocuSign documents that are Word Documents through two ways. When viewing a document during an approval step or task, you can either: From the Edit menu, select Open document OR From the Edit menu, select Open with Office Online If you do not want to simply open a copy in Office Online and have to re-upload it into DocuSign CLM, you can use the DocuSign Edit App by following the first step ( Open document ). Instructions Once in the task and viewing the affiliated document, you can select Edit in the upper right-hand corner. From the drop-down menu, select Open document . Once you do, you will be prompted to download the Docusign Edit app if you have not previously done so. Proceed to download from the DocuSign support article , selecting the option for macOS. Follow the installation guide upon opening the DocuSignEdit.pkg on your computer. After it is installed, when you go to select the Open document , you will then be prompted to authorize your DocuSign Edit app by logging into DocuSign. Upon following the prompt to log into DocuSign, you will then have your application authorized. These steps are only needed the first time you select the Open document option.", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4893769745/DocuSign+CLM+DocuSign+Edit+App", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4893769745", "version": 1, "last_modified": "2025-01-14T18:43:18.986Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "4893802556", "title": "DocuSign CLM", "type": "page"}], "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
