{"id": "confluence_4428169266", "title": "AI Guides: Approved AI Tools", "content": "Simplifi Guidelines: AI Employee Usage As an employee, it is your responsibility to understand how AI systems process data and to ensure that only suitable information is entered into these systems. This obligation is an extension of the confidentiality clause you signed upon your employment with Simplifi. Any incidents involving the disclosure of confidential or highly confidential information, whether within these systems or similar ones, may lead to disciplinary action. For general inquiries regarding AI tools, please reach out to the #digital-workplace Slack channel or Request Access to approved Ai tools. If you have questions about your responsibilities in evaluating AI tools for personal use or need guidance on initiating a compliance review, please refer to the following pages: We encourage everyone to default to Gemini , our official AI tool. Other approved tools are listed below: List of Approved AI Tools Gemini (already available in your Okta dashboard) Cursor ( Request Access ) Open AI’s ChatGPT ( Request Access ) GitHub Copilot ( Request Access ) Make ( Request Access ) Waymark ( Request Access ) Dall-E Grammarly Copilot (this includes the use of autocomplete for code writing) ChatSpot AI by GitHub Zoom AI Reclaim AI Monday Asana Clockwise Typewise", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4428169266/AI+Guides+Approved+AI+Tools", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4428169266", "version": 11, "last_modified": "2025-06-12T16:15:50.082Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
