{"id": "confluence_4995645483", "title": "Digital Workplace Service Desk: Agent Instructions & Use Cases", "content": "Introduction: Use Cases Welcome, Digital Workplace Service Desk (DWS) agents! You've been added to our team to manage critical workflows across various areas. Your responsibilities include taking action on tickets related to: Employee Lifecycle Events : Onboarding, off-boarding, role changes, etc. Application Approvals : Managing access requests for applications you oversee. Data Privacy and Compliance : Handling requests concerning sensitive data and regulatory adherence. Hardware and Peripherals : Fulfilling requests for equipment and devices. Security Incidents : Addressing and resolving security-related issues. Managing Your Assigned Tickets When a triggering event occurs, you'll receive an assigned ticket. This could be a task, access request, security request, hardware request, or a general support issue. Here are the instructions for how you can efficiently resolve these requests: Accessing Your Tickets : Log into Jira to view the Service Desk Portal issues assigned to you in your \"My Open Issues\" in the queue . Alternatively, you can click the link in the Jira email notification you receive when an issue is assigned. Changing Assignee : To assign a ticket to yourself or reassign it to another DWS agent, select the \"Assignee\" field on the right-hand side of the issue in Jira. Choose the appropriate agent from the dropdown. Updating Ticket Status : Start Work : When you're ready to begin working on a ticket, change its status from \"Open\" to \"Work in Progress.\" You can do this directly on the ticket in Jira, or by using the relevant emoji in the #digital-workplace Slack channel if the request originated there. → Will assign the ticket to you. → Will automatically close out the ticket -> Will assign to Work in Progress or Pending Pause SLA (Pending) : If you need to pause the SLA (Service Level Agreement) clock because you're waiting for information or action from the requester, a vendor, or another party, change the ticket status from \"Work in Progress\" to \"Pending.\" You can do this on the ticket itself, or via the relevant emoji in the #digital-workplace Slack channel . Close Ticket : Once you've successfully addressed and resolved the issue, change the ticket status from \"Pending\" or \"Work in Progress\" to \"Closed.\" This can be done directly on the ticket in Jira, or via the relevant emoji in the #digital-workplace Slack channel . Commenting on Issues : You can add comments to an issue via Slack (if it originated in the #digital-workplace channel) or directly through the Jira interface. Add internal note: Use this option if your comment is only for other service desk agents. This is ideal for resolution notes, troubleshooting steps, or questions for colleagues. Reply to customer: Choose this option if your comment is intended to be visible to the requester. This will also send them an email notification, depending on their Jira notification settings. Log into Jira to see the Service Desk Portal issues you have assigned to yourself in the queue (My Open Issues). Alternatively, you can click the link in an email from Jira when notified of the issue assignment. To change an assignee (whether assigning to yourself or someone else), select the Assignee field on the right-hand side of the issue. You have the option to assign it to yourself or another person with agent access to the DWS service desk. When you are ready to start work on the ticket, move it from Open to Work in Progress . You can do this on the ticket itself, or via the emoji in #digital-workplace if the request originated there. If you need to pause the SLA clock on a ticket because you are waiting on something from the requester, a vendor, or other party, move the ticket from Work in Progress to Pending . You can do this on the ticket itself, or via the emoji in #digital-workplace if the request originated there. You can comment on the issue via Slack (if it was submitted in #digital-workplace channel at its inception), or via the Jira interface. If you need to comment on the issue in Jira, there are two options: Add internal note : Will only show the comment to fellow service desk agents. This is often used to communicate issue resolution notes or questions for other agents. Reply to customer : Will show the comment as visible to the issue’s requestor, and will also send them an email (depending on whether they’ve turned off Jira notifications to email). When you have addressed the issue in the ticket, move it from its Pending or Work in Progress status to a Closed status. You can do this on the ticket itself, or via the emoji in #digital-workplace if the request originated there. Reminder Messages Once a week, an Okta workflow will message you in Slack if you have any outstanding Digital Workplace service desk tickets that are not closed. Advanced Handling: Keyboard Shortcuts If you despise clicking around on a ticket, you might enjoy utilizing the Atlassian Jira Keyboard Shortcuts . These allow you to quickly open ( o ), assign to someone else ( a ), assign to yourself ( i ), or add a comment ( m ) among other options.", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4995645483/Digital+Workplace+Service+Desk+Agent+Instructions+Use+Cases", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4995645483", "version": 2, "last_modified": "2025-06-12T15:14:32.726Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3492479001", "title": "Atlassian Enterprise Products:", "type": "page"}, {"id": "3493003273", "title": "Jira Enterprise:", "type": "page"}], "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
