{"id": "confluence_3908173867", "title": "IcePanel", "content": "IcePanel is an Engineering / Dev app. It is recommended to use Chrome to access this application see below for Firefox settings. Requesting Access Access to the IcePanel application can be requesting using our self service Access request system. Info on requesting access to apps: https://simplifi.atlassian.net/l/cp/ziLxB3VD Once you have requested access, the Digital Workplace team will send you an invite to your email from the IcePanel tenant. Click sign up and Join in to accept. Accessing the App. On your Okta dashboard or plugin, you will see an IcePanel tile like below. This tile will ONLY take you to the Icepanel login page itself. From here you will click the Login button shown below. This will log you directly without any other user interaction. Note: If you have not already logged into your Okta dashboard then you may be prompted for your Okta credentials and MFA Digital Workplace recommends always logging into your Dashboard or plug when you log into your machine in the morning. This will give you one click access into all of your available applications and you wont be prompt for credentials, this often occurs when a user has not logged in and tries to access each app directly. Click the Log in with SAML SSO button. Enter your email address and and click the Log in with SAML SSO button on this screen. Administration - Admin use only When a user requests access and a message is received via Slack, log into Okta/svc.okta@ (credentials in Bitwarden) and then log into the IcePanel console via the link https://app.icepanel.io/user/login/saml Click the Manage gear icon in the screenshot below. Click organization members. Click Invite and enter the users email address. Editor is licensed, Viewer is free. (typically, use Viewer and Admin or DW can edit as needed.)", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3908173867/IcePanel", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3908173867", "version": 6, "last_modified": "2024-04-30T21:27:46.998Z", "author": "Rodney Estrada", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}], "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
