{"id": "confluence_4371808263", "title": "Digital Workplace Solutions: Jira Service Desk", "content": "HALP! The Digital Workplace team has historically assisted users through SIX different means: Okta Access Requests Portal Okta Slack App Access Shortcuts #digital-workplace Slack channel digitalworkplace@simpli.fi Email Address workflow-automations-notifications channel (alerts us when there are manual tasks to complete based on workflow triggers with applications that we set in Okta) Individual DMs in Slack (not recommended Help Us Help You In the coming months, we’ll be building out bot workflows to respond to keywords in your messages. These will share resources and tips with you related to your inquiry. However, it’s not going to be perfect. Like any other language model or human behavior, it benefits from training. Give the bot feedback if it’s not helpful (it will ask!). Heck, give US feedback if we’re not helping you. Anything at all that you’d like to see working differently, let us know. Give us a rating when we close your issue… Leave us a comment in the issue’s thread in Slack… Reach out to digitalworkplace@simpli.fi if there’s something the whole team needs to hear…", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4371808263/Digital+Workplace+Solutions+Jira+Service+Desk", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4371808263", "version": 3, "last_modified": "2024-09-19T20:20:46.496Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3492479001", "title": "Atlassian Enterprise Products:", "type": "page"}, {"id": "3493003273", "title": "Jira Enterprise:", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
