{"id": "confluence_3607986225", "title": "OKTA Application Integrations", "content": "App Name Deploy Date Log in Options Groups/Users Membership Provisioning CutOff Date (non OKTA signins) Owner Access Request/Self Serve? 1 AIRBRAKE.io 10.17.2022 OKTA Specific Dev Team Users Manual Invite Manual Deprov 10.17.2022 yes 2 ASTRO 11.1.2022 OKTA thru Astro Signin Page Development Manual Invite Manual Deprov 11.1.2022 yes 3 Artifactory-Prod/Dev 2.22.2023 OKTA 50+ Dev users Manual Invite Manual Deprov Diane P yes with approval diane P 4 Atlassian -Confluence -Jira 05.24.2023 Okta All Simplifi Okta Rodney Estrada Not needed typically 5 BITWARDEN OKTA thru the BW sign in page and choosing Enterprise Single Sign on. Specific Engineering Users Okta provisions based on group membership. (bitwarden_app) yes with Approval 6 DATADOG 11.15.2022 Email/PW Google OKTA Engineering Manual Invite Manual Deprov yes 7 DOCUSIGN 11.1.2022 OKTA HR no 8 DRUVA 12.15.2022 Username/Pw OKTA Facilities Okta Prov/Deprov no 9 Fidelity 11.1.2022 Self Administered User inputs login/pw All FTE End User managed NA na 10 Figma 8.21.2023 Currently All Allowed figma_app OKTA SCIM 8.29.2023 Austin Mays Yes 11 Glint 03.02.2023 Okta HR only Manual no 12 Google-Advantage 02.02.2023 Okta Limited Advantage users Okta Fully Provisions/Deprov users no 13 ICE PANEL 11.1.2022 OKTA but thru IP login screen only. Specific Eng/DevOps Manual Invite Manual Deprov 11.1.2022 Josh Scott yes 14 Lever 04.10.2023 Okta HR,Managers, limited users Manual Invite Manual Deprov yes w approval 15 Microsoft O365 01.31.2023 Okta Limited Intune users Okta handles all Prov/deprov Digital Workplace no 16 Midaxo 02.23.2023 Okta Limited Execs Manual Prov Manual Deprov no 17 MIMECAST 1.5.2023 OKTA InfoSec Manual for Admin console 1.5.2023 no 18 Miro (formerly Real Time Board) 6.20.2023 Okta Mixed Okta handles all Provisioning 6.20.2023 Isaac Garcia Yes 19 PAGERDUTY 12.1.2022 OKTA DEVOPS/ENG Okta Prov/Deprov based on group membership. PagerDuty_app_user 12.1.2022 Yes 20 Perimeter81 12.1.2022 OKTA EMAIL/PW GOOGLE DEVOPS/ENG Okta Prov/Deprov Based on Group Membership Perimeter81_app Yes 21 Progression 4.19.2023 Okta Engineering (future groups coming) Okta no 22 Rippling 11.1.2022 Self Administered User inputs login/pw All FTE End User managed for username/pw 2Q 2023 na 23 SalesForce On-Going Okta Sales Okta will manage Not yet 24 SalesLoft 8.24.2023 Okta Sales Okta Robyn Ansura Yes 25 SentinelOne 1.5.2023 OKTA Infosec Manual Prov/Deprov sentinelone_app 1.5.2023 no 26 Simplifi UI 2.1.2023 Okat SWA user sets username/pw to store. All Employees Manual Invites Manual Deprov no 27 Slack OnGoing Okta/Google All Empoyees Okta will handle all provisioning/deproviosning no 28 Sprout Social 2.23.2023 Okta All Employees Manual Prov Manual Deprov no 29 TRELICA 11.1.2022 OKTA Digital Workplace (All 2Q 2023) Manual Invite Manual Deprov Based on need of App owners 11.1.2022 no 30 NAVAN / TRIP ACTIONS 1.5.2023 OKTA Email/PW All FTE Okta handles all Provisioning Google is no longer an option no 31 Zendesk 4.5.2023 Okta Depends on Group membership, or need Okta handles Provisioning/Deprov based on groups/roles not yet 32 ZOOM 12.15.2022 OKTA Google All FTE/Contrctors Okta Provisions/Deprov users. zoom_app 2Q 2023 Yes for license upgrade/downgrade", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3607986225/OKTA+Application+Integrations", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3607986225", "version": 17, "last_modified": "2023-08-21T19:26:28.859Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3620143105", "title": "Initial Setup", "type": "page"}, {"id": "3662577671", "title": "How To Use Okta", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
