{"id": "confluence_4517953614", "title": "DocuSign Google Integration", "content": "With the DocuSign Google Integration, you can sign documents, send documents, and take critical actions from within your everyday use of the Google Suite interface. Please only using this integration if you have a DocuSign account through Simpli.fi . You can obtain this DocuSign account by requesting access (in the Okta Access Request portal or via Slack /access docusign shortcut.) The DocuSign Google integration is pre-installed in your Google applications. You can utilize it by taking the actions below: Instructions Log into your Google mail inbox via your Okta portal or by going directly to mail.google.com. On the right-hand, side navigation menu, you’ll notice that the DocuSign app has been added to your Gmail integrations. Click the DocuSign logo. Authorize the application to see relevant data in Google. by clicking the Authorize access button. Select the Simpli.fi account you’d like to authorize and click Continue . If you are comfortable with the permissions, click Allow . Click the Log In button that shows after approving access. You will be prompted to enter your Simpli.fi email. Select Use company login when prompted. Provided you have an account with us via Okta, Okta will pass your credentials and complete the integration. Once you have authorized the integration, you will be able to quickly set up any received PDF for signatures (or sign yourself). Through this integration, you can also opt into saving important documents to your Google Drive. This will allow your team members to have access to files once constrained to the visibility of your inbox. ( For more information, check out the DocuSign marketing collateral on this feature! )", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4517953614/DocuSign+Google+Integration", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4517953614", "version": 2, "last_modified": "2024-08-19T20:36:09.130Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "4513169437", "title": "DocuSign E-Signature", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
