{"id": "confluence_4512809054", "title": "FAQ's: The Move to DocuSign", "content": "What does this mean for me as an Acrobat Sign user? If you need to be able to edit PDFs frequently, you can utilize Acrobat Business Standard. We will keep this functionality available and have licenses already assigned to those who have needed it historically. If you currently use Adobe Acrobat Sign for documents sent for electronic signatures, you will receive a direct Slack message notifying you of this change and confirming that you have been assigned a DocuSign account ( ). Does this impact other Adobe products? No. Anyone who needs access to Creative Cloud products (e.g., Illustrator, PhotoShop, Acrobat Pro) will still keep these licenses. When will this change take place? We have access to DocuSign currently and will be adding all Adobe Users into DocuSign Okta groups starting August 19th. When should I stop using AdobeSign? Please stop using AdobeSign as soon as you see the DocuSign tile in your Okta dashboard (by end of day August 19th). We will hide the AdobeSign Okta tile on August 20th so as to prevent confusion; but please also stop sending files for signature through it. What will happen to all of my files? You can download your Acrobat Sign files to your team’s shared Google Drive (preferable). If your team does not have a shared Google Drive, consider creating one", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/4512809054/FAQ+s+The+Move+to+DocuSign", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "4512809054", "version": 6, "last_modified": "2024-09-18T17:48:17.278Z", "author": "Ashley Graham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "4513169437", "title": "DocuSign E-Signature", "type": "page"}, {"id": "4512874554", "title": "Transition from Adobe Acrobat Sign", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
