{"id": "confluence_3758293159", "title": "Datadog Guide: Applications Keys & Service Accounts", "content": "Service accounts are non-interactive accounts designed to manage application keys and other resources shared among teams. For instance, consider a scenario where an employee creates a monitoring dashboard using their personal application key. If that employee departs from the company, their Datadog account is deactivated, rendering their application key inactive. Consequently, the monitoring dashboard will cease to function until someone updates it with a valid application key. To prevent this issue, utilizing a service account application key instead of a personal application key for automated requests to the Datadog API is highly recommended. Note: Creating Service Accounts requires admin access. To view / access service accounts in the UI: Navigate to Organization Settings from your account menu. Under Accounts , select Service Accounts . Create service account To create a service account, perform the following steps: Click New Service Account . A dialog box appears. Enter a name and email address for your service account. Note: This can be a Google Group email address. Use the Assign Roles dropdown menu to choose one or more roles for your service account. Custom roles can be created to ensure that the service account has only the access it needs. Find out how to create custom roles here. To save, click Create Service Account . Unlike the email addresses for Datadog users, service account email addresses do not need to be unique across an organization. Edit service account To modify a service account, click on one in the service accounts list. In the side panel, click Edit next to the service account name. A dialog box appears. Update any fields you would like to change. You can edit the name, email address, status, and roles. Click Save . To disable a service account, follow the procedure above to edit the service account and set the status to Disabled . Create or revoke application keys To create or revoke service account application keys, select an account from the service account list. The service account’s side panel appears. To create a new application key, follow the steps below: Click New Key . A dialog box appears. Give the key a descriptive name. Click Create Key . The dialog box refreshes, showing you the key. Copy and paste the key into your desired location. After you close the dialog box, you cannot retrieve the value of the key. To revoke an application key, locate the key in the service account detailed view side panel and hover over it. You will see pencil and trash can icons appear on the right side. Click the trash can icon to revoke the key. After revocation, click Confirm . Note: You can view a service account application key only once, immediately after its creation. Limiting access to the application key helps prevent issues that may arise if another user gains access to it. If you lose or forget a service account key, revoke it and create a new one. Permissions Creating a service account allows you to establish an entity that interacts with Datadog on your behalf. The options available to you on the Service Accounts page are determined by your specific Datadog roles and permissions. To create a service account, you must possess the Service Account Write permission. This permission is included in the Datadog Admin role, meaning that anyone with this role can create service accounts. When setting up a service account, you have the flexibility to assign it any combination of the roles and permissions that you hold. However, if you have the User Access Manage permission, you effectively gain administrator-level access, allowing you to perform any action within Datadog. Accounts with the User Access Manage permission face no limitations regarding the roles and permissions they can assign to service accounts. Notifications Datadog sends a notification to the email address associated with the service account when the following actions occur: Create an application key Revoke an application key Disable the service account", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3758293159/Datadog+Guide+Applications+Keys+Service+Accounts", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3758293159", "version": 4, "last_modified": "2025-06-13T18:20:25.603Z", "author": "Bill Price", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3758850051", "title": "Datadog Guide:", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
