{"id": "confluence_3949101198", "title": "New Phone, Who Dis? : Okta After a Device Change", "content": "If you get a new phone (or new work computer!), the Digital Workplace Solutions team can work with you to reset authenticators in Okta that were tied to your former device. What follows are some steps you can take (and supporting documentation) to setup your new device for seamless login… Instructions: If You Only Have Authenticators on Replaced Device Reach out to the Digital Workplace team in our Digital Workplace Slack channel , letting us know you got a new device. We will reset any authenticators tied to your new device from within the Okta Admin Portal. You will then need to set up impacted authenticators by . Instructions: If You Have Authenticators Across Devices If you happened to already have other authenticators established that are not impacted by the new device, you can log into Okta. On your laptop, go to login.simpli.fi and login with your alternate authentication method You can select, Verify with something else when logging into Okta to change how you authenticate. Select the drop-down menu by your name in the upper, right-hand corner of the Okta portal. Select My Settings. Identify the Security Methods settings. Remove the replaced device Click ‘Set up another’ Verify with your alternative authentication method On your phone, download the Okta Verify app from your app store and open the app. In the app, click the ‘ + ' sign in the upper right hand corner, select ‘ Organization ’, ‘ Skip ', then ' Yes, Ready to Scan ’ Scan the QR code on your computer screen On your phone, it is suggested to NOT ‘Enable FaceID Confirmation’ Done! Instructions: Enabling touchID login on your Mac https://simplifi.atlassian.net/l/cp/sc7H3qVZ", "url": "https://simplifi.atlassian.net/wiki/spaces/DW/pages/3949101198/New+Phone+Who+Dis+Okta+After+a+Device+Change", "metadata": {"source": "confluence", "space": "DW", "space_name": "Digital Workplace Solutions", "page_id": "3949101198", "version": 11, "last_modified": "2025-03-17T20:54:32.897Z", "author": "Kaitlin Purdham", "ancestors": [{"id": "3473048177", "title": "Digital Workplace Solutions", "type": "page"}, {"id": "3492511763", "title": "Simplifi Employee Technical Guides", "type": "page"}, {"id": "3621290012", "title": "Okta", "type": "page"}, {"id": "3627122699", "title": "Okta Troubleshooting Guides", "type": "page"}], "child_count": 0, "permissions": {"read_restrictions": {"users": [], "groups": []}, "update_restrictions": {"users": [], "groups": []}, "is_restricted": false}, "is_restricted": false}}
